[
  {
    "year": "2025",
    "date": null,
    "blog": "https://www.eferro.net/2025/10/keynote-desapego-radical-en-la-era-de.html",
    "video": "https://youtu.be/z1rlvuYP3Ec",
    "presentation": "https://docs.google.com/presentation/d/1hIT5C0R1BMt1ZcnlGeyreO8hSq4Zh0PWAPIOeboOl7A/edit",
    "place": "BarcelonaSoftwareCrafters",
    "coauthors": null,
    "last_modified": "29/12/2025 3:30pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "Keynote: Desapego radical en la era de la IA",
    "name_es": "Keynote: Desapego radical en la era de la IA",
    "description_en": "This talk explores how AI serves as a catalyst to reinvent the software profession, urging a shift from manual coding toward a product-focused mindset where technical excellence and radical detachment from traditional practices enable high-impact problem solving.",
    "description_es": "Esta charla explora cómo la IA actúa como catalizador para reinventar la profesión del software, impulsando un cambio desde la programación manual hacia una mentalidad orientada a producto donde la excelencia técnica y el desapego radical de las prácticas tradicionales permiten resolver problemas de alto impacto.",
    "key_learning_en": "Software professionals should embrace radical detachment from traditional manual coding to reinvent themselves as product-focused problem solvers who prioritize generating impact over writing lines of code,. By maintaining technical excellence through disciplined practices like testing and modularity, engineers can leverage AI as a multiplier to navigate growing complexity and deliver sustainable, high-value solutions,.",
    "key_learning_es": "Los profesionales del software deben abrazar el desapego radical de la programación manual tradicional para reinventarse como solucionadores de problemas orientados a producto, priorizando generar impacto por encima de escribir líneas de código. Manteniendo la excelencia técnica mediante prácticas disciplinadas como testing y modularidad, los ingenieros pueden aprovechar la IA como multiplicador para navegar la creciente complejidad y entregar soluciones sostenibles de alto valor.",
    "key_points_en": "- AI as a Multiplier of Technical Habits: AI does not simply accelerate work; it multiplies the existing culture. In environments with poor practices (\"deserts\"), it creates technical debt faster, whereas in high-excellence environments (\"forests\"), it acts as a massive force multiplier for high-quality software.\n- Radical Detachment from Manual Coding: Professionals must stop identifying themselves by their code and treat manual programming as a means rather than an end. In the coming decades, manual coding will likely become a recreational hobby, similar to solving puzzles or Sudoku.\n- Transition to Product Engineering: The primary goal is solving problems and generating impact, not writing lines of code. Engineers must adopt a product-focused mindset, focusing on understanding the problem domain and the real-world impact of the systems they build.\n- Technical Excellence is Mandatory: Good practices such as TDD, modularity, clean code, and automated testing are more critical than ever. AI thrives on well-structured, semantic, and modular codebases, making disciplined engineering essential to prevent system collapse under AI-generated complexity.\n- Shifting Industry Bottlenecks: The bottleneck is moving away from code construction toward discovery, problem definition, and validation. Success now depends on correctly selecting the right opportunities to pursue and verifying that the system achieves the desired effect.\n- The Rise of the Generalist: The ability to connect knowledge across different specialties is becoming more valuable than niche framework expertise. As AI handles specific technical details, the professional's value lies in their ability to act as a generalist who can bridge various technical and business fields.\n- Developer Laziness Scale as a Meta-Skill: Engineers must develop the sensitivity to know when to use AI with 100% autonomy (for low-risk exploration) and when to perform line-by-line verification (for critical systems). This meta-skill of knowing the appropriate level of oversight is fundamental in the AI era.\n- The FAAFO Framework: Professional success in this era is defined by being Fast, Ambitious, Autonomous, Fun, and offering high Optionality. This requires a willingness to perform radical simplification and deletion of code or experiments that do not contribute to the final goal.\n- Community-Led Reinvention: The software profession must be reinvented by practitioners who understand the nature of software rather than by external management consultants. Shared learning, open spaces, and safe experimentation in communities are vital for navigating this transition.\n",
    "key_points_es": "- La IA como multiplicador de hábitos técnicos: La IA no simplemente acelera el trabajo; multiplica la cultura existente. En entornos con malas prácticas (\"desiertos\"), crea tech debt más rápido, mientras que en entornos de alta excelencia (\"bosques\"), actúa como un multiplicador masivo para software de alta calidad.\n- Desapego radical de la programación manual: Los profesionales deben dejar de identificarse con su código y tratar la programación manual como un medio y no como un fin. En las próximas décadas, la programación manual probablemente se convertirá en un hobby recreativo, similar a resolver puzzles o Sudoku.\n- Transición hacia Product Engineering: El objetivo principal es resolver problemas y generar impacto, no escribir líneas de código. Los ingenieros deben adoptar una mentalidad orientada a producto, enfocándose en entender el dominio del problema y el impacto real de los sistemas que construyen.\n- La excelencia técnica es obligatoria: Las buenas prácticas como TDD, modularidad, clean code y testing automatizado son más críticas que nunca. La IA prospera en bases de código bien estructuradas, semánticas y modulares, haciendo que la ingeniería disciplinada sea esencial para evitar el colapso del sistema bajo la complejidad generada por IA.\n- Cambio de bottlenecks en la industria: El bottleneck se está moviendo desde la construcción de código hacia discovery, definición de problemas y validación. El éxito ahora depende de seleccionar correctamente las oportunidades adecuadas a perseguir y verificar que el sistema logra el efecto deseado.\n- El ascenso del generalista: La capacidad de conectar conocimiento a través de diferentes especialidades se vuelve más valiosa que la expertise en frameworks específicos. Conforme la IA maneja detalles técnicos específicos, el valor del profesional reside en su capacidad de actuar como generalista que puede hacer de puente entre diversos campos técnicos y de negocio.\n- Developer Laziness Scale como meta-skill: Los ingenieros deben desarrollar la sensibilidad para saber cuándo usar IA con 100% autonomía (para exploración de bajo riesgo) y cuándo realizar verificación línea por línea (para sistemas críticos). Esta meta-skill de conocer el nivel apropiado de supervisión es fundamental en la era de la IA.\n- El framework FAAFO: El éxito profesional en esta era se define por ser Fast, Ambitious, Autonomous, Fun y ofrecer alta Optionality. Esto requiere disposición para realizar simplificación radical y eliminación de código o experimentos que no contribuyen al objetivo final.\n- Reinvención liderada por la comunidad: La profesión del software debe ser reinventada por practicantes que entienden la naturaleza del software y no por consultores de gestión externos. El aprendizaje compartido, espacios abiertos y experimentación segura en comunidades son vitales para navegar esta transición.\n"
  },
  {
    "year": "2025",
    "date": null,
    "blog": "https://www.eferro.net/2025/09/charla-incentivos-perversos-resultados-previsibles.html",
    "video": "https://www.youtube.com/watch?v=qlnCzTZXQkw",
    "presentation": "https://docs.google.com/presentation/d/1Lj_RSuA3lWt1kaAokPwxAledbq7hrDDsblpagYInNII/edit",
    "place": "FredCon 25",
    "coauthors": null,
    "last_modified": "29/12/2025 3:34pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "Incentivos perversos, resultados previsibles. Cuando el sistema sabotea a los equipos",
    "name_es": "Incentivos perversos, resultados previsibles. Cuando el sistema sabotea a los equipos",
    "description_en": "This talk explores how outdated Taylorist incentives sabotage software teams and advocates for a shift toward flow efficiency, systemic improvement, and shared responsibility to achieve sustainable impact and high-quality results.",
    "description_es": "Esta charla explora cómo los incentivos tayloristas obsoletos sabotean a los equipos de software y aboga por un cambio hacia flow efficiency, mejora sistémica y responsabilidad compartida para lograr impacto sostenible y resultados de alta calidad.",
    "key_learning_en": "High-performing software delivery requires a fundamental shift from Taylorist resource efficiency to systemic flow efficiency, acknowledging that the organizational system itself—not individual effort—is responsible for over 90% of performance results. To achieve sustainable impact, teams must abandon silos and local optimization in favor of shared responsibility, built-in quality, and an empowered focus on the \"why\" behind their work, as quality and purpose are the true drivers of velocity.\nTo understand this better, consider a traffic jam: Taylorist resource efficiency is like trying to pack every square inch of the highway with cars to maximize \"road usage,\" which only leads to total gridlock. Flow efficiency, however, focuses on how quickly a single car can get to its destination, recognizing that leaving some \"slack\" or empty space in the system is actually what allows everyone to move faster.",
    "key_learning_es": "La entrega de software de alto rendimiento requiere un cambio fundamental desde la eficiencia de recursos taylorista hacia la eficiencia de flujo sistémica, reconociendo que el sistema organizacional en sí —no el esfuerzo individual— es responsable de más del 90% de los resultados de rendimiento. Para lograr impacto sostenible, los equipos deben abandonar los silos y la optimización local en favor de responsabilidad compartida, built-in quality y un enfoque empoderado en el \"por qué\" detrás de su trabajo, ya que la calidad y el propósito son los verdaderos drivers de la velocidad.\nPara entenderlo mejor, considera un atasco de tráfico: la eficiencia de recursos taylorista es como intentar llenar cada centímetro cuadrado de la autopista con coches para maximizar el \"uso de la carretera\", lo cual solo conduce a un bloqueo total. La flow efficiency, sin embargo, se enfoca en qué tan rápido un solo coche puede llegar a su destino, reconociendo que dejar algo de \"slack\" o espacio vacío en el sistema es en realidad lo que permite a todos moverse más rápido.",
    "key_points_en": "- The System vs. Individuals: Approximately 90% of performance depends on the organizational system rather than individual effort; high-performing teams require a system designed for collaboration, not local optimization.\n- The Resource Efficiency Trap: Obsessing over 100% individual occupancy (resource efficiency) creates chronic bottlenecks, handoff delays, and silos. High-performing organizations prioritize Flow Efficiency, focusing on how quickly value reaches the customer.\n- Quality Enabliness: The perceived trade-off between quality and speed is a myth. High technical quality is the primary driver of sustainable velocity, whereas deferred quality leads to chronic firefighting and technical debt.\n- Connection to Purpose: Teams must understand the \"why,\" \"for whom,\" and the intended impact of their work to avoid \"feature factories\" that produce irrelevant products and waste talent.\n- Built-in Quality over Inspection: Quality should be integrated from the start (e.g., TDD, continuous feedback) rather than being treated as a final inspection phase handled by a separate silo.\n- Work-in-Progress (WIP) Limits: Limiting WIP is the most effective way to optimize flow, reduce context switching, and encourage team members to assist in areas outside their primary specialization.\n- Shared Responsibility: Move away from \"my part\" handoffs toward cross-functional teams that take end-to-end ownership of opportunities, from selection and design to release and operation.\n- Hiring for Mindset: Prioritize attitude, product thinking, and collaboration skills over specific technical stacks, as technical skills are easier to teach than a mindset of shared responsibility.\n- Systemic Improvement: Managers must lead by example, visualize errors without blame (blameless post-mortems), and focus on improving the system rather than finding individual culprits.\n- Iterative Experimentation: Organizational changes should be framed as time-bound experiments with clear success criteria to reduce resistance and allow for data-driven adjustments.\n- Hacking Incentives: Align performance reviews and career paths with team impact and global optimization rather than individual outputs or local metrics.\n",
    "key_points_es": "- El sistema vs. los individuos: Aproximadamente el 90% del rendimiento depende del sistema organizacional en lugar del esfuerzo individual; los equipos de alto rendimiento requieren un sistema diseñado para la colaboración, no para la optimización local.\n- La trampa de la eficiencia de recursos: Obsesionarse con el 100% de ocupación individual (resource efficiency) crea bottlenecks crónicos, retrasos en handoffs y silos. Las organizaciones de alto rendimiento priorizan Flow Efficiency, enfocándose en qué tan rápido el valor llega al cliente.\n- Quality Enablers: El trade-off percibido entre calidad y velocidad es un mito. La alta calidad técnica es el driver principal de velocidad sostenible, mientras que la calidad diferida conduce a firefighting crónico y tech debt.\n- Conexión con el propósito: Los equipos deben entender el \"por qué\", \"para quién\" y el impacto pretendido de su trabajo para evitar \"feature factories\" que producen productos irrelevantes y desperdician talento.\n- Built-in Quality sobre inspección: La calidad debe integrarse desde el inicio (ej. TDD, continuous feedback) en lugar de tratarse como una fase de inspección final manejada por un silo separado.\n- Límites de Work-in-Progress (WIP): Limitar el WIP es la forma más efectiva de optimizar el flujo, reducir el context switching y alentar a los miembros del equipo a asistir en áreas fuera de su especialización primaria.\n- Responsabilidad compartida: Alejarse de handoffs de \"mi parte\" hacia equipos cross-funcionales que tomen ownership end-to-end de oportunidades, desde selección y diseño hasta release y operación.\n- Contratar por mindset: Priorizar actitud, product thinking y habilidades de colaboración sobre stacks técnicos específicos, ya que las habilidades técnicas son más fáciles de enseñar que un mindset de responsabilidad compartida.\n- Mejora sistémica: Los managers deben liderar con el ejemplo, visualizar errores sin culpa (blameless post-mortems) y enfocarse en mejorar el sistema en lugar de buscar culpables individuales.\n- Experimentación iterativa: Los cambios organizacionales deben enmarcarse como experimentos acotados en tiempo con criterios claros de éxito para reducir resistencia y permitir ajustes basados en datos.\n- Hackear los incentivos: Alinear performance reviews y career paths con el impacto del equipo y optimización global en lugar de outputs individuales o métricas locales.\n"
  },
  {
    "year": "2025",
    "date": null,
    "blog": "https://www.eferro.net/2025/06/charla-el-coste-oculto-de-la.html",
    "video": "https://www.youtube.com/watch?v=1neJHKu8sZ8",
    "presentation": "https://docs.google.com/presentation/d/1068uu3GTYzeEiES0uNUVCQMvDXyFiEq9wFvkQbRLPqs/edit",
    "place": "Pamplona Software Crafters",
    "coauthors": null,
    "last_modified": "29/12/2025 3:38pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "El coste oculto de la complejidad: reconstruyendo una Data Platform",
    "name_es": "El coste oculto de la complejidad: reconstruyendo una Data Platform",
    "description_en": "This talk details how rebuilding a Data Platform through proactive simplification and the adaptation of Lean and XP practices allowed Clarity AI to significantly reduce firefighting and triple its innovation capacity.",
    "description_es": "Esta charla detalla cómo la reconstrucción de una Data Platform mediante simplificación proactiva y la adaptación de prácticas Lean y XP permitió a Clarity AI reducir significativamente el firefighting y triplicar su capacidad de innovación.",
    "key_learning_en": "True efficiency in a data environment is achieved by treating the platform as a product and using simplicity as a primary lever to eliminate accidental complexity. Organizations should remember that by adapting Lean and XP practices and shifting incentives from technical outputs to business outcomes, they can collapse feedback loops and triple their capacity for innovation.",
    "key_learning_es": "La verdadera eficiencia en un entorno de datos se logra tratando la platform como un producto y usando la simplicidad como palanca principal para eliminar complejidad accidental. Las organizaciones deben recordar que, adaptando prácticas Lean y XP y cambiando incentivos desde outputs técnicos hacia outcomes de negocio, pueden colapsar feedback loops y triplicar su capacidad de innovación.",
    "key_points_en": "- Shift the focus from technical outputs to business outcomes, moving away from a culture that rewards technical \"heroics\" or simply checking off roadmap items.\n- Treat the Data Platform as a product, prioritizing internal developer experience (DevEx), self-service autonomy, and clear ownership through versioned APIs.\n- Use proactive simplification as the primary lever for efficiency, aggressively identifying and removing accidental complexity and unused assets (e.g., deleting obsolete tables and code).\n- Challenge the \"Big Data\" myth by identifying when complex distributed systems are overkill for what are actually \"small data\" problems that could be solved with simpler, more reliable tools.\n- Adapt modern software engineering practices (XP and Lean) to the data lifecycle, implementing TDD, pair programming, and continuous integration with data-specific adaptations like statistical quality tests and schema validation.\n- Realign team incentives and hiring, valuing software engineering fundamentals and product sensitivity over hyper-specialization in complex, non-commodity technical stacks.\n- Question architectural dogmas and legacy constraints, ensuring that technical debt or \"upfront design\" decisions from the past do not act as permanent blockers to current business needs.\n- Identify system \"seams\" to enable modularity, allowing teams to bypass monolithic pipelines and deliver value incrementally through evolutionary design.\n- Prioritize system reliability and feedback loops, making production incidents and CI/CD stability the highest priority to reclaim time for innovation.\n- Collapse delivery timelines from months or weeks to days to triple innovation capacity and reduce the high cost of delayed feedback in data environments.\n",
    "key_points_es": "- Cambiar el foco de outputs técnicos a outcomes de negocio, alejándose de una cultura que recompensa \"heroicidades\" técnicas o simplemente marcar items del roadmap.\n- Tratar la Data Platform como un producto, priorizando la developer experience (DevEx) interna, autonomía de self-service y ownership claro mediante APIs versionadas.\n- Usar la simplificación proactiva como palanca principal para la eficiencia, identificando y eliminando agresivamente complejidad accidental y assets no usados (ej. eliminar tablas y código obsoleto).\n- Desafiar el mito del \"Big Data\" identificando cuándo los sistemas distribuidos complejos son excesivos para lo que en realidad son problemas de \"small data\" que podrían resolverse con herramientas más simples y confiables.\n- Adaptar prácticas modernas de ingeniería de software (XP y Lean) al ciclo de vida de datos, implementando TDD, pair programming y continuous integration con adaptaciones específicas de datos como statistical quality tests y schema validation.\n- Realinear incentivos del equipo y contratación, valorando fundamentos de ingeniería de software y sensibilidad de producto sobre hiper-especialización en stacks técnicos complejos no-commodity.\n- Cuestionar dogmas arquitectónicos y restricciones legacy, asegurando que tech debt o decisiones de \"diseño upfront\" del pasado no actúen como blockers permanentes para las necesidades de negocio actuales.\n- Identificar \"seams\" del sistema para habilitar modularidad, permitiendo a los equipos saltarse pipelines monolíticos y entregar valor incrementalmente mediante diseño evolutivo.\n- Priorizar confiabilidad del sistema y feedback loops, haciendo que los incidentes de producción y la estabilidad de CI/CD sean la máxima prioridad para recuperar tiempo para innovación.\n- Colapsar timelines de entrega de meses o semanas a días para triplicar capacidad de innovación y reducir el alto costo del feedback retrasado en entornos de datos.\n"
  },
  {
    "year": "2024",
    "date": null,
    "blog": "https://www.eferro.net/2024/06/talk-slides-lean-software-development.html",
    "video": null,
    "presentation": "https://docs.google.com/presentation/d/1yIXNvBgBiu2ME0PQoRPTT8mqLOygu5yAvk0kfSR0ir8/edit",
    "place": "Agile Real Life",
    "coauthors": null,
    "last_modified": "29/12/2025 3:42pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "Lean Software Development: A more effective Agile",
    "name_es": "Lean Software Development: Un Agile más efectivo",
    "description_en": "This talk explores how misaligned incentives and hero culture lead teams into a complexity trap, advocating for Lean Software Development and proactive simplification to reduce the basal cost and accidental complexity of software.",
    "description_es": "Esta charla explora cómo los incentivos desalineados y la hero culture llevan a los equipos a la trampa de la complejidad, abogando por Lean Software Development y simplificación proactiva para reducir el coste basal y la complejidad accidental del software.",
    "key_learning_en": "Organizations must escape the \"complexity trap\" by realigning incentives away from \"hero culture\" and toward proactive simplification, acknowledging that all existing code carries an ongoing basal cost that can eventually consume a team's entire capacity for innovation. Sustainable success requires the continuous elimination of waste and accidental complexity through Lean principles and small, safe steps, ensuring that software remains a professional asset rather than a rotting liability.",
    "key_learning_es": "Las organizaciones deben escapar de la \"trampa de la complejidad\" realineando incentivos lejos de la \"hero culture\" hacia la simplificación proactiva, reconociendo que todo el código existente conlleva un coste basal continuo que eventualmente puede consumir toda la capacidad de innovación del equipo. El éxito sostenible requiere la eliminación continua de desperdicio y complejidad accidental mediante principios Lean y small, safe steps, asegurando que el software siga siendo un activo profesional en lugar de un pasivo en putrefacción.",
    "key_points_en": "- Software Reality: Software development is a team activity and a means to an end, not an end in itself.\n- Basal Cost: Every line of code added has a continuous basal cost (maintenance, cognitive load, and impact on future features) that exists until that code is deleted.\n- The Building Fallacy: Unlike physical construction, software evolution is constant; if not managed, the cumulative cost of existing features will eventually consume the team's entire capacity for innovation.\n- Essential vs. Accidental Complexity: Essential complexity represents business rules, while accidental complexity is waste arising from implementation side effects that should be proactively minimized.\n- Incentive Misalignment: Cultures that reward \"technology collecting,\" \"resume-driven development,\" or \"hero culture\" (celebrating last-minute firefighting) incentivize unnecessary complexity and reactive behavior.\n- Software Obsolescence: Software ages like milk, not wine; it requires constant updates because its environment and dependencies change at a rate the team does not control.\n- Four Dimensions of Value: Professional value includes increasing revenue, protecting revenue, reducing costs, and—most crucially—avoiding future costs.\n- Lean Principles: High-performing teams utilize Lean software development to reduce waste, amplify learning, and deliver in small, safe steps.\n- Deciding as Late as Possible: Delaying irreversible decisions allows teams to maintain options and act on better information once the \"next piece of the puzzle\" is visible.\n- Proactive Simplification: Professionalism involves simplifying proactively and deleting unnecessary code or features to reduce technical debt and drama.\n- Quality and Speed: There is no trade-off between quality and speed in the medium term; integrating quality from the start is the only way to maintain a sustainable delivery flow.\n- Hero Culture Mitigation: Organizations should replace hero culture with sustainable practices like pairing, blameless post-mortems, and knowledge sharing to prevent single points of failure.\n",
    "key_points_es": "- Realidad del Software: El desarrollo de software es una actividad de equipo y un medio para un fin, no un fin en sí mismo.\n- Coste Basal: Cada línea de código añadida tiene un coste basal continuo (mantenimiento, carga cognitiva e impacto en features futuras) que existe hasta que ese código se elimina.\n- La falacia de la construcción: A diferencia de la construcción física, la evolución del software es constante; si no se gestiona, el coste acumulativo de las features existentes eventualmente consumirá toda la capacidad de innovación del equipo.\n- Complejidad esencial vs. accidental: La complejidad esencial representa reglas de negocio, mientras que la complejidad accidental es desperdicio que surge de efectos secundarios de implementación que deberían minimizarse proactivamente.\n- Desalineación de incentivos: Las culturas que recompensan \"coleccionar tecnologías\", \"resume-driven development\" o \"hero culture\" (celebrar firefighting de último minuto) incentivan complejidad innecesaria y comportamiento reactivo.\n- Obsolescencia del software: El software envejece como la leche, no como el vino; requiere actualizaciones constantes porque su entorno y dependencias cambian a un ritmo que el equipo no controla.\n- Cuatro dimensiones del valor: El valor profesional incluye incrementar ingresos, proteger ingresos, reducir costes y —más crucial— evitar costes futuros.\n- Principios Lean: Los equipos de alto rendimiento utilizan Lean software development para reducir desperdicio, amplificar aprendizaje y entregar en small, safe steps.\n- Decidir lo más tarde posible: Retrasar decisiones irreversibles permite a los equipos mantener opciones y actuar con mejor información una vez que la \"siguiente pieza del puzzle\" es visible.\n- Simplificación proactiva: La profesionalidad implica simplificar proactivamente y eliminar código o features innecesarias para reducir tech debt y drama.\n- Calidad y velocidad: No existe trade-off entre calidad y velocidad a medio plazo; integrar calidad desde el inicio es la única forma de mantener un flujo de entrega sostenible.\n- Mitigación de hero culture: Las organizaciones deben reemplazar la hero culture con prácticas sostenibles como pairing, blameless post-mortems y knowledge sharing para evitar single points of failure.\n"
  },
  {
    "year": "2024",
    "date": null,
    "blog": "https://www.eferro.net/2024/03/cps-live-2024-presentaciones-mental.html",
    "video": null,
    "presentation": "https://docs.google.com/presentation/d/1oo7VRNGaYzUEMnKBFP8mlR7ItyvyysfU6olUKV_1Xno/edit",
    "place": "CPS Live 2024",
    "coauthors": null,
    "last_modified": "28/12/2025 6:58pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "The Complexity Trap: Reevaluating our incentives",
    "name_es": "La trampa de la complejidad: Reevaluando nuestros incentivos",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2024",
    "date": null,
    "blog": "https://www.eferro.net/2024/03/cps-live-2024-presentaciones-mental.html",
    "video": null,
    "presentation": null,
    "place": "CPS Live 2024",
    "coauthors": null,
    "last_modified": "28/12/2025 7:00pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "Mental Models for Product Developers",
    "name_es": "Modelos mentales para Product Developers",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2023",
    "date": "6/10/2023",
    "blog": "https://www.eferro.net/2023/10/devopsdays-madrid-complexity-trap.html",
    "video": "https://youtu.be/wqHo44xrc9I",
    "presentation": "https://docs.google.com/presentation/d/1mpEHeIY0wYJc8LoDMdoJ582U7MxwkJSlx-onJ0Jow98/edit",
    "place": "DevopsDays Madrid",
    "coauthors": null,
    "last_modified": "28/12/2025 7:00pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "La trampa de la complejidad: Reevaluando nuestros incentivos",
    "name_es": "La trampa de la complejidad: Reevaluando nuestros incentivos",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2023",
    "date": "25/11/2023",
    "blog": null,
    "video": null,
    "presentation": "https://docs.google.com/presentation/d/13QlV-6E5AORxeE8NA1BklGZ7GSjFmX1vkPFP2ThWWmc/edit",
    "place": "La Vertical Valencia",
    "coauthors": null,
    "last_modified": "10/12/2023 12:25am",
    "core": false,
    "talk_language": "Spanish",
    "name_en": "La trampa de la complejidad: Reevaluando nuestros incentivos",
    "name_es": "La trampa de la complejidad: Reevaluando nuestros incentivos",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2023",
    "date": "1/5/2023",
    "blog": "https://www.eferro.net/2023/05/lean-coffee-defer-commitment-postponer.html",
    "video": "https://youtu.be/OmQ8zoQvn8I",
    "presentation": null,
    "place": "Software Crafters Barcelona / Software Crafters Madrid, Murcia Software Crafters, Software Crafters Málaga",
    "coauthors": null,
    "last_modified": "10/12/2023 12:23am",
    "core": false,
    "talk_language": "Spanish",
    "name_en": "Lean Coffe: Defer Commitment / Postponer decisiones",
    "name_es": "Lean Coffee: Defer Commitment / Posponer decisiones",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2023",
    "date": "16/3/2023",
    "blog": "https://www.eferro.net/2023/03/lean-software-development-defer.html",
    "video": null,
    "presentation": "https://docs.google.com/presentation/d/1Sfo88p9RvWlDZ7AuRjL7aEWCbZwijLNlAmCVL6GJRQ8/edit",
    "place": "Madridagile meetup",
    "coauthors": null,
    "last_modified": "10/12/2023 12:24am",
    "core": false,
    "talk_language": "Spanish",
    "name_en": "Lean Software Development: Posponer decisiones (Charla)",
    "name_es": "Lean Software Development: Posponer decisiones (Charla)",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2022",
    "date": null,
    "blog": "https://www.eferro.net/2022/10/scbcn22-taller-desarrollo-lean-posponer.html",
    "video": null,
    "presentation": "https://docs.google.com/presentation/d/1IwElIJiTI4Ol_vFx9vq3y4Z2x_06irZ2IzDDYHphnGA/edit?usp=sharing",
    "place": "BarcelonaSoftwareCrafters",
    "coauthors": "Isidro Lopez",
    "last_modified": "9/12/2023 10:49pm",
    "core": false,
    "talk_language": "Spanish",
    "name_en": "SCBCN22: Taller Desarrollo Lean: posponer decisiones",
    "name_es": "SCBCN22: Taller Desarrollo Lean: posponer decisiones",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2022",
    "date": null,
    "blog": "https://www.eferro.net/2022/06/platformcon-2022-lightning-talk-how-we.html",
    "video": "https://youtu.be/Bh4lvGUnVZc",
    "presentation": "https://docs.google.com/presentation/d/1LA7snTlUwW4e9FjeZiTKJV4aG3MiAvzQp-4yD1KEJx0/edit",
    "place": "PlatformCon",
    "coauthors": null,
    "last_modified": "29/12/2025 3:46pm",
    "core": true,
    "talk_language": "English",
    "name_en": "PlatformCon 2022 lightning talk: How we improve the Developer Experience at ClarityAI",
    "name_es": "PlatformCon 2022 lightning talk: Cómo mejoramos la Developer Experience en ClarityAI",
    "description_en": "This talk demonstrates how ClarityAI scales high-performance teams by treating its internal platform as a product, leveraging Team Topologies to reduce developer cognitive load and transforming manual release processes into automated, \"fire and forget\" workflows.",
    "description_es": "Esta charla demuestra cómo ClarityAI escala equipos de alto rendimiento tratando su platform interna como un producto, aprovechando Team Topologies para reducir la carga cognitiva de los desarrolladores y transformando procesos de release manuales en workflows automatizados \"fire and forget\".",
    "key_learning_en": "Scaling a high-performance engineering organization requires treating the internal platform as a product that prioritizes the reduction of developer cognitive load and the optimization of value flow. Success is achieved by transforming manual, high-friction processes into automated, \"fire and forget\" workflows developed through continuous discovery and a deep focus on the developer as the primary customer.\nThink of a modern platform as a well-maintained highway; while developers still drive the vehicle of business logic, the platform team removes the toll booths and clears the debris, allowing them to reach their destination at maximum speed without having to navigate the rough terrain of infrastructure on their own.",
    "key_learning_es": "Escalar una organización de ingeniería de alto rendimiento requiere tratar la platform interna como un producto que priorice la reducción de la carga cognitiva del desarrollador y la optimización del flujo de valor. El éxito se logra transformando procesos manuales de alta fricción en workflows automatizados \"fire and forget\" desarrollados mediante continuous discovery y un enfoque profundo en el desarrollador como cliente principal.\nPiensa en una platform moderna como una autopista bien mantenida; mientras los desarrolladores aún conducen el vehículo de la lógica de negocio, el equipo de platform elimina las casetas de peaje y despeja los escombros, permitiéndoles llegar a su destino a máxima velocidad sin tener que navegar el terreno difícil de la infraestructura por su cuenta.",
    "key_points_en": "- Adopt a Platform as a Product mindset, focusing on the developer as the primary customer and optimizing for flow rather than just managing infrastructure.\n- Prioritize the reduction of developer cognitive load, enabling teams to dedicate more mental energy to business logic instead of low-level platform details.\n- Transition from a traditional ticket-oriented service model to a modern product-oriented approach that measures success through speed and platform adoption.\n- Use continuous discovery techniques—such as shadowing, interviews, and surveys—to align platform development with actual user needs.\n- Leverage instrumentation to identify critical paths and bottlenecks before attempting to optimize processes.\n- Implement changes through Small Safe Steps (3S) and parallel changes to deliver value quickly while minimizing risk.\n- Transform manual, error-prone release processes into automated \"fire and forget\" workflows (e.g., via Slack commands) that provide fast, clear feedback.\n- Maintain the Thinnest Viable Platform (TVP) by building only what is essential and leveraging external services or open-source software to avoid over-engineering.\n- Ensure adoption is not forced, but rather earned by creating tools that are easy to use and demonstrably reduce friction for stream-aligned teams.\n- Evolve organizational structures using Team Topologies to facilitate scalability and maintain clear ownership across different domains.\n- Promote engineering excellence by modeling best practices such as trunk-based development, TDD, and continuous delivery within the platform team.\n",
    "key_points_es": "- Adoptar un mindset de Platform as a Product, enfocándose en el desarrollador como cliente principal y optimizando para flujo en lugar de solo gestionar infraestructura.\n- Priorizar la reducción de carga cognitiva del desarrollador, permitiendo a los equipos dedicar más energía mental a lógica de negocio en lugar de detalles de platform de bajo nivel.\n- Transicionar de un modelo tradicional de servicio orientado a tickets hacia un enfoque moderno orientado a producto que mide éxito mediante velocidad y adopción de la platform.\n- Usar técnicas de continuous discovery —como shadowing, entrevistas y encuestas— para alinear el desarrollo de la platform con las necesidades reales de los usuarios.\n- Aprovechar instrumentación para identificar critical paths y bottlenecks antes de intentar optimizar procesos.\n- Implementar cambios mediante Small Safe Steps (3S) y parallel changes para entregar valor rápidamente minimizando riesgo.\n- Transformar procesos de release manuales propensos a errores en workflows automatizados \"fire and forget\" (ej. vía comandos de Slack) que proveen feedback rápido y claro.\n- Mantener la Thinnest Viable Platform (TVP) construyendo solo lo esencial y aprovechando servicios externos u open-source software para evitar over-engineering.\n- Asegurar que la adopción no sea forzada, sino ganada creando herramientas fáciles de usar que demuestren reducir fricción para stream-aligned teams.\n- Evolucionar estructuras organizacionales usando Team Topologies para facilitar escalabilidad y mantener ownership claro a través de diferentes dominios.\n- Promover excelencia en ingeniería modelando best practices como trunk-based development, TDD y continuous delivery dentro del equipo de platform.\n"
  },
  {
    "year": "2022",
    "date": "24/3/2022",
    "blog": "https://www.eferro.net/2022/03/mesa-redonda-colaboracion-entre.html",
    "video": "https://youtu.be/LRIV0BNK-mA",
    "presentation": null,
    "place": "Code Sherpas",
    "coauthors": "Marta Manso,Maria Granadino,Isabel Garrido,Cristina Verdi",
    "last_modified": "10/12/2023 12:27am",
    "core": false,
    "talk_language": "Spanish",
    "name_en": "Mesa Redonda: Colaboración entre perfiles de producto y desarrollo (Code Sherpas)",
    "name_es": "Mesa Redonda: Colaboración entre perfiles de producto y desarrollo (Code Sherpas)",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2022",
    "date": null,
    "blog": "https://www.eferro.net/2022/03/our-devops-journey-clarityai-2022-03.html",
    "video": "https://youtu.be/SgzcalNjf30",
    "presentation": "https://docs.google.com/presentation/d/1ue5hoMSVxUOmZqCu3BKUPc_w_MiJjsnmMpM5u0RDmJI/edit?usp=sharing",
    "place": "Devops Lisbon",
    "coauthors": null,
    "last_modified": "29/12/2025 3:49pm",
    "core": true,
    "talk_language": "English",
    "name_en": "Our DevOps Journey @ ClarityAI",
    "name_es": "Nuestro viaje DevOps @ ClarityAI",
    "description_en": "This talk details Clarity AI's two-year evolution from siloed chapters to stream-aligned teams using Team Topologies, highlighting the shift toward managed services, self-service infrastructure, and a dedicated DevEx team to reduce toil and accelerate product delivery.\n",
    "description_es": "Esta charla detalla la evolución de dos años de Clarity AI desde chapters aislados hacia stream-aligned teams usando Team Topologies, destacando el cambio hacia managed services, infraestructura de self-service y un equipo dedicado de DevEx para reducir toil y acelerar la entrega de producto.\n",
    "key_learning_en": "Transitioning from functional silos to a Team Topologies-driven structure—supported by a self-service platform and a dedicated Developer Experience team—allows a growing organization to scale effectively by reducing toil and empowering teams with clear end-to-end ownership. Success in this DevOps journey lies in \"making it easy to do the right thing\" through managed services and automated tools that minimize friction in the development flow while aligning infrastructure efforts with the product roadmap.",
    "key_learning_es": "La transición desde silos funcionales hacia una estructura impulsada por Team Topologies —soportada por una platform de self-service y un equipo dedicado de Developer Experience— permite a una organización en crecimiento escalar efectivamente reduciendo toil y empoderando equipos con ownership end-to-end claro. El éxito en este viaje DevOps reside en \"hacer fácil hacer lo correcto\" mediante managed services y herramientas automatizadas que minimizan fricción en el flujo de desarrollo mientras alinean esfuerzos de infraestructura con el roadmap de producto.",
    "key_points_en": "- Organizational Scaling through Team Topologies: Transitioned from functional chapters (silos) where engineers reported to chapter leads to stream-aligned teams where engineers report directly to Squad Team Leads, enhancing cross-functionality and ownership.\n- Defining DevOps as Culture: Emphasized that DevOps is not a role or a team but a culture focused on end-to-end flow, small batches, fast feedback loops, and experimentation.\n- Reducing Platform Basal Cost and Toil: Focused on reducing the effort required just to maintain existing infrastructure (Basal Cost) and eliminating repetitive, manual tasks (toil) to free up time for innovation.\n- Platform Principles: Adopted core principles to buy/use managed services instead of self-building, simplify by removing unneeded systems, and ensure everything is self-service.\n- Managed Service Migration: Replaced self-managed tools with managed solutions like AWS EKS (Kubernetes), MongoDB Atlas, and Datadog (monitoring) to reduce maintenance overhead.\n- Dedicated Developer Experience (DevEx) Team: Created a DevEx team specifically to reduce friction in the product development flow and promote engineering best practices like fast feedback and quality.\n- Reinforcing Squad Ownership: Utilized \"Acceptance Criteria\" for performance, operability, and scalability to make it clear that squads—not the platform team—own the end-to-end lifecycle of their services.\n- Self-Service Automation via Platform Bot: Developed a Slack-based Platform Bot to automate credential management, deployments, and database migrations, removing the platform team as a bottleneck.\n- Improving Delivery Performance: Increased release frequency for the monolith from every 2–3 weeks to once per week with zero downtime, while enabling new services to deploy on-demand.\n- \"Making it Easy to do the Right Thing\": Focused on a cultural shift where the platform provides tools and paths that are so low-friction they naturally become the preferred way for developers to work.\n- Future Initiatives: Plans include increasing release frequency further and establishing a Talent Acceleration Program to train junior staff in Extreme Programming (XP) and the DevOps mindset.\n",
    "key_points_es": "- Escalado organizacional mediante Team Topologies: Transición desde functional chapters (silos) donde los ingenieros reportaban a chapter leads hacia stream-aligned teams donde los ingenieros reportan directamente a Squad Team Leads, mejorando cross-funcionalidad y ownership.\n- Definir DevOps como cultura: Se enfatizó que DevOps no es un rol o equipo sino una cultura enfocada en flujo end-to-end, small batches, fast feedback loops y experimentación.\n- Reducir Platform Basal Cost y toil: Enfoque en reducir el esfuerzo requerido solo para mantener infraestructura existente (Basal Cost) y eliminar tareas repetitivas manuales (toil) para liberar tiempo para innovación.\n- Principios de platform: Se adoptaron principios core de comprar/usar managed services en lugar de self-building, simplificar eliminando sistemas no necesarios y asegurar que todo sea self-service.\n- Migración a Managed Services: Se reemplazaron herramientas self-managed con soluciones managed como AWS EKS (Kubernetes), MongoDB Atlas y Datadog (monitoring) para reducir overhead de mantenimiento.\n- Equipo dedicado de Developer Experience (DevEx): Se creó un equipo DevEx específicamente para reducir fricción en el flujo de desarrollo de producto y promover best practices de ingeniería como fast feedback y quality.\n- Reforzar Squad Ownership: Se utilizaron \"Acceptance Criteria\" para performance, operability y scalability para dejar claro que los squads —no el equipo de platform— poseen el lifecycle end-to-end de sus servicios.\n- Automatización Self-Service vía Platform Bot: Se desarrolló un Platform Bot basado en Slack para automatizar credential management, deployments y database migrations, eliminando el equipo de platform como bottleneck.\n- Mejorar Delivery Performance: Se incrementó la frecuencia de release del monolito de cada 2–3 semanas a una vez por semana con zero downtime, mientras se habilitó a nuevos servicios hacer deploy on-demand.\n- \"Hacer fácil hacer lo correcto\": Enfoque en un cambio cultural donde la platform provee herramientas y caminos tan de baja fricción que naturalmente se vuelven la forma preferida de trabajo para desarrolladores.\n- Iniciativas futuras: Los planes incluyen incrementar la frecuencia de release aún más y establecer un Talent Acceleration Program para entrenar al personal junior en Extreme Programming (XP) y el mindset DevOps.\n"
  },
  {
    "year": "2022",
    "date": "27/2/2022",
    "blog": "https://www.eferro.net/2022/02/charla-experiencia-de-desarrollo.html",
    "video": "https://youtu.be/7036fdABbZk",
    "presentation": "https://docs.google.com/presentation/d/13QKTl2yPCSrrNYjLD5gkX1NlZfXRKlbePHoUCR4iRck/edit?usp=sharing",
    "place": "Agile Delivery / Pamplona Software Crafters / Agile Sur / Agile Norte",
    "coauthors": null,
    "last_modified": "29/12/2025 3:52pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "Experiencia de Desarrollo & Equipos de Plataforma Modernos",
    "name_es": "Experiencia de Desarrollo & Equipos de Plataforma Modernos",
    "description_en": "This talk explains how to scale engineering teams by treating the platform as a product to optimize Developer Experience (DevEx) and reduce cognitive load through Team Topologies and Extreme Programming (XP) practices.",
    "description_es": "Esta charla explica cómo escalar equipos de ingeniería tratando la platform como un producto para optimizar la Developer Experience (DevEx) y reducir la carga cognitiva mediante Team Topologies y prácticas de Extreme Programming (XP).",
    "key_learning_en": "Successfully scaling engineering organizations depends on treating the internal platform as a product that prioritized Developer Experience (DevEx) and the reduction of cognitive load,. By focusing on fast flow and applying Lean and Extreme Programming (XP) practices, platform teams can transform from ticket-oriented cost centers into accelerators that enable stream-aligned teams to focus entirely on delivering business value,.",
    "key_learning_es": "Escalar organizaciones de ingeniería con éxito depende de tratar la platform interna como un producto que priorice la Developer Experience (DevEx) y la reducción de carga cognitiva. Enfocándose en fast flow y aplicando prácticas Lean y Extreme Programming (XP), los equipos de platform pueden transformarse desde cost centers orientados a tickets hacia aceleradores que permiten a los stream-aligned teams enfocarse completamente en entregar valor de negocio.",
    "key_points_en": "- Scaling Engineering Organizations: Successful growth requires adopting a clear team nomenclature, such as Team Topologies, utilizing stream-aligned teams for product delivery and platform teams as accelerators.\n- Platform as a Product: Internal platforms should be treated as products with engineers as the customers, utilizing modern product management practices like discovery, MVPs, shadowing users, and user personas.\n- Reducing Cognitive Load: The platform's primary mission is to minimize extraneous cognitive load (the effort required by tools and internal mechanisms) so developers can focus on germane load (solving the actual business domain problems).\n- Optimizing Developer Experience (DevEx): High-performing teams focus on reducing friction in daily developer activities, including onboarding, service creation, deployment systems, and troubleshooting.\n- Engineering Excellence through Lean and XP: Sustainability is achieved by applying Extreme Programming (XP) and Lean practices such as simplicity, YAGNI (You Aren't Gonna Need It), TDD (Test-Driven Development), and small safe steps.\n- Modern vs. Traditional Platforms: Modern platform teams shift from being ticket-oriented infrastructure silos to product-oriented enablers that prioritize flow and platform adoption over resource usage or cost reduction.\n    - Strategic Risk Mitigation:Build vs. Buy: Organizations should prioritize managed services or open-source tools over building internal solutions to avoid unnecessary maintenance costs and technical silos.\n    - Optional Adoption: Platforms should be so easy and valuable to use that adoption is natural; forcing adoption can hide poor product quality.\n- Cross-Functional Team Dynamics: Platform teams should be small and multi-skilled, incorporating rotational members from stream-aligned teams to act as \"ambassadors\" who spread best practices across the organization.\n- Measurable Business Impact: Automating manual, high-friction processes (e.g., replacing manual release steps with a one-click Slack command) can drastically reduce pipeline duration and lead times, saving thousands of engineering hours and significant operational costs.\n- Organizational Context: Specialized DevEx and platform teams are generally most effective in organizations with over 100 developers or those undergoing rapid, frenetic growth.\n",
    "key_points_es": "- Escalar organizaciones de ingeniería: El crecimiento exitoso requiere adoptar una nomenclatura clara de equipos, como Team Topologies, utilizando stream-aligned teams para entrega de producto y platform teams como aceleradores.\n- Platform as a Product: Las platforms internas deben tratarse como productos con los ingenieros como clientes, utilizando prácticas modernas de product management como discovery, MVPs, shadowing users y user personas.\n- Reducir carga cognitiva: La misión principal de la platform es minimizar la carga cognitiva extraña (el esfuerzo requerido por herramientas y mecanismos internos) para que los desarrolladores puedan enfocarse en germane load (resolver los problemas reales del dominio de negocio).\n- Optimizar Developer Experience (DevEx): Los equipos de alto rendimiento se enfocan en reducir fricción en actividades diarias del desarrollador, incluyendo onboarding, service creation, deployment systems y troubleshooting.\n- Excelencia en ingeniería mediante Lean y XP: La sostenibilidad se logra aplicando prácticas de Extreme Programming (XP) y Lean como simplicity, YAGNI (You Aren't Gonna Need It), TDD (Test-Driven Development) y small safe steps.\n- Platforms modernas vs. tradicionales: Los equipos de platform modernos cambian desde ser silos de infraestructura orientados a tickets hacia enablers orientados a producto que priorizan flujo y adopción de platform sobre uso de recursos o reducción de costes.\n- Mitigación de riesgo estratégico - Build vs. Buy: Las organizaciones deben priorizar managed services o open-source tools sobre construir soluciones internas para evitar costes de mantenimiento innecesarios y silos técnicos.\n- Adopción opcional: Las platforms deben ser tan fáciles y valiosas de usar que la adopción sea natural; forzar la adopción puede ocultar mala calidad de producto.\n- Dinámica de equipos cross-funcionales: Los equipos de platform deben ser pequeños y multi-skilled, incorporando miembros rotacionales de stream-aligned teams para actuar como \"embajadores\" que difundan best practices a través de la organización.\n- Impacto de negocio medible: Automatizar procesos manuales de alta fricción (ej. reemplazar pasos de release manuales con un comando de Slack de un clic) puede reducir drásticamente la duración del pipeline y lead times, ahorrando miles de horas de ingeniería y costes operacionales significativos.\n- Contexto organizacional: Los equipos especializados de DevEx y platform son generalmente más efectivos en organizaciones con más de 100 desarrolladores o aquellas experimentando crecimiento rápido y frenético.\n"
  },
  {
    "year": "2022",
    "date": "29/1/2022",
    "blog": "https://www.eferro.net/2022/01/talk-developer-experience-modern.html",
    "video": null,
    "presentation": "https://docs.google.com/presentation/d/1tBhfWYkOIsvtd__nxm0Dcm8aaV4mr-YZCxkLtYOec4c/edit?usp=sharing",
    "place": "Bilbostack",
    "coauthors": null,
    "last_modified": "28/12/2025 7:01pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "Experiencia de Desarrollo & Equipos de Plataforma Modernos",
    "name_es": "Experiencia de Desarrollo & Equipos de Plataforma Modernos",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2021",
    "date": null,
    "blog": "https://www.eferro.net/2021/05/charla-coste-basal-y-la-falacia-de-la.html",
    "video": null,
    "presentation": "https://docs.google.com/presentation/d/1mPZIxoZiTWLhbGrPENw1DV4Scq3InUg-2f04FXpC-qk/edit?usp=sharing",
    "place": "Agile en Español",
    "coauthors": null,
    "last_modified": "28/12/2025 8:01pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "Coste basal y la falacia de la construcción",
    "name_es": "Coste basal y la falacia de la construcción",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2021",
    "date": null,
    "blog": "https://www.eferro.net/2021/03/talk-3s-small-safe-steps-secret-to.html",
    "video": "https://www.youtube.com/watch?v=B2niPlMyuw0",
    "presentation": "https://docs.google.com/presentation/d/1U8Pq_7orJbK53Ma_8GDaiN94aaub0s_7mCw7U4yZ2J8/edit?usp=sharing",
    "place": "Software Development Summit",
    "coauthors": null,
    "last_modified": "29/12/2025 6:49pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "Small Safe Steps: The secret to agility",
    "name_es": "Small Safe Steps: El secreto de la agilidad",
    "description_en": "This talk presents the Small Safe Steps (3S) approach, demonstrating how ruthless technical and product slicing minimizes risk and accelerates learning through frequent deployments and rapid feedback.",
    "description_es": "Esta charla presenta el enfoque Small Safe Steps (3S), demostrando cómo el slicing despiadado de producto y técnico minimiza riesgos y acelera el aprendizaje mediante deployments frecuentes y rapid feedback.",
    "key_learning_en": "Achieving true agility depends on the Small Safe Steps (3S) approach, which centers on mercilessly slicing both product and technical work into the smallest possible increments to enable frequent deployments. This strategy reduces risk and accelerates learning by providing short feedback cycles that validate business value and system stability in real production environments.\nIn essence, navigating complex software development using this approach is like crossing a rushing river by stepping only on small, stable stones—it allows you to test your footing and change direction frequently rather than risking everything on a single, massive leap.",
    "key_learning_es": "Lograr verdadera agilidad depende del enfoque Small Safe Steps (3S), que se centra en dividir despiadadamente tanto el trabajo de producto como técnico en los incrementos más pequeños posibles para habilitar deployments frecuentes. Esta estrategia reduce riesgo y acelera el aprendizaje proporcionando ciclos de feedback cortos que validan valor de negocio y estabilidad del sistema en entornos de producción reales.\nEn esencia, navegar el desarrollo de software complejo usando este enfoque es como cruzar un río caudaloso pisando solo piedras pequeñas y estables—te permite probar tu apoyo y cambiar de dirección frecuentemente en lugar de arriesgar todo en un único salto masivo.",
    "key_points_en": "- Agility through Feedback: True agility is based on frequent inspection and adaptation via short feedback cycles for both business (the \"what\") and technology (the \"how\").\n- Production as Value: Code has zero value and represents only risk and cost until it is deployed to production; real learning only happens in a live environment.\n- Small Safe Steps (3S): The core strategy involves making transitions as a sequence of small, verifiable, and reversible steps to minimize risk.\n- Built-in Quality: Safety is achieved by integrating quality into the process from the start using XP practices (TDD, ATDD) and optimizing for a fast time to recover (MTTR) rather than trying to prevent all failures.\n- Psychological Safety: Team safety is not just cultural but also technical; it requires robust testing, observability, and the confidence that deployments won't cause \"firefighting\" scenarios.\n- Merciless Slicing:\n    - Product/Vertical Slicing: Breaking user stories into the smallest end-to-end increments to validate hypotheses quickly and maximize the amount of work not done.\n    - Technical Slicing: Decomposing technical changes (architecture, persistence) to enable continuous integration and daily trunk-based development.\n- Decoupling Deployment from Release: Separating the act of putting code in production from making it visible to users (using feature toggles or dark launching) allows for technical validation without business risk.\n- Small Batch Optimization: Reducing batch size minimizes \"transaction costs\" (deployment effort) and \"holding costs\" (delayed value). Small batches make it significantly easier to identify and fix bugs.\n- Continuous Delivery: The primary goal of continuous delivery is to make working in small batches safe and economically viable.\n- Technical Strategies: Use techniques like Dark Launching, Branch by Abstraction, and the \"Expand and Contract\" pattern to handle complex migrations and parallel implementations safely.\n",
    "key_points_es": "- Agilidad mediante feedback: La verdadera agilidad se basa en inspección y adaptación frecuentes vía ciclos de feedback cortos tanto para negocio (el \"qué\") como para tecnología (el \"cómo\").\n- Producción como valor: El código tiene cero valor y solo representa riesgo y coste hasta que se hace deploy a producción; el aprendizaje real solo ocurre en un entorno live.\n- Small Safe Steps (3S): La estrategia core implica hacer transiciones como una secuencia de small, verifiable y reversible steps para minimizar riesgo.\n- Built-in Quality: La seguridad se logra integrando calidad en el proceso desde el inicio usando prácticas XP (TDD, ATDD) y optimizando para un fast time to recover (MTTR) en lugar de intentar prevenir todos los fallos.\n- Psychological Safety: La seguridad del equipo no es solo cultural sino también técnica; requiere testing robusto, observability y la confianza de que los deployments no causarán escenarios de \"firefighting\".\n- Merciless Slicing:\n    - Product/Vertical Slicing: Dividir user stories en los incrementos end-to-end más pequeños para validar hipótesis rápidamente y maximizar la cantidad de trabajo no hecho.\n    - Technical Slicing: Descomponer cambios técnicos (arquitectura, persistencia) para habilitar continuous integration y trunk-based development diario.\n- Desacoplar Deployment de Release: Separar el acto de poner código en producción de hacerlo visible a los usuarios (usando feature toggles o dark launching) permite validación técnica sin riesgo de negocio.\n- Optimización de Small Batch: Reducir batch size minimiza \"transaction costs\" (esfuerzo de deployment) y \"holding costs\" (valor retrasado). Los small batches hacen significativamente más fácil identificar y arreglar bugs.\n- Continuous Delivery: El objetivo principal de continuous delivery es hacer que trabajar en small batches sea seguro y económicamente viable.\n- Estrategias técnicas: Usar técnicas como Dark Launching, Branch by Abstraction y el patrón \"Expand and Contract\" para manejar migraciones complejas e implementaciones paralelas de forma segura.\n"
  },
  {
    "year": "2020",
    "date": null,
    "blog": "https://www.eferro.net/2020/06/technology-at-core-of-product-discovery.html",
    "video": "https://www.youtube.com/watch?v=xeGHvXwCk1M",
    "presentation": "https://docs.google.com/presentation/d/1xvVaU6EpTgB0COvw7NmR568RS0H9oDhSX5nCr9KwJOI/edit",
    "place": "aktia solutions",
    "coauthors": null,
    "last_modified": "29/12/2025 6:55pm",
    "core": true,
    "talk_language": "English",
    "name_en": "Technology at the Core of Product Discovery /Webminar",
    "name_es": "Tecnología en el Core de Product Discovery /Webminar",
    "description_en": "This talk provides an engineering perspective on product discovery, illustrating how empowered engineers drive innovation and why technical systems must be designed to optimize learning to maximize impact and reduce waste.",
    "description_es": "Esta charla proporciona una perspectiva de ingeniería sobre product discovery, ilustrando cómo los ingenieros empoderados impulsan la innovación y por qué los sistemas técnicos deben diseñarse para optimizar el aprendizaje para maximizar impacto y reducir desperdicio.",
    "key_learning_en": "High-performance teams must treat software as a costly liability to minimize and engage empowered engineers as central drivers of product discovery to maximize actual impact while reducing waste. By designing technical architectures to optimize for continuous learning and rapid experimentation, teams can shift their focus from delivering mere outputs to achieving meaningful business outcomes.\nTo think of this shift in perspective, imagine a scientific laboratory instead of a construction site: the goal isn't just to stack as many bricks as possible, but to run the fewest, smartest experiments needed to discover a breakthrough.",
    "key_learning_es": "Los equipos de alto rendimiento deben tratar el software como un pasivo costoso a minimizar e involucrar a ingenieros empoderados como drivers centrales de product discovery para maximizar impacto real mientras se reduce desperdicio. Diseñando arquitecturas técnicas para optimizar continuous learning y experimentación rápida, los equipos pueden cambiar su enfoque desde entregar meros outputs hacia lograr outcomes de negocio significativos.\nPara pensar en este cambio de perspectiva, imagina un laboratorio científico en lugar de una obra de construcción: el objetivo no es solo apilar tantos ladrillos como sea posible, sino ejecutar los experimentos más inteligentes y menos numerosos necesarios para descubrir un breakthrough.",
    "key_points_en": "- Software is a liability to minimize: It is extremely expensive to build, maintain, and evolve; treat it as costly inventory that consumes cognitive load and capacity rather than an asset.\n- Focus on outcomes over outputs: Success is measured by actual impact, value, and user behavior changes, not by functionalities, story points, or the quantity of code delivered.\n- Empowered engineers drive innovation: Engineers are the single best source for innovation and should be collaborative partners in discovering what to build, not just \"code monkeys\" executing predefined requirements.\n- The Vicious Cycle of Software: Every line of code added increases maintenance and cognitive load; if not managed, this debt eventually consumes all innovation capacity.\n- Decouple deployment from release: Use feature flags to separate technical code deployments from business release decisions, enabling safer and more frequent experimentation.\n- Architecture must facilitate discovery: Technical systems should be designed to prioritize learning, optionality, and low experimentation costs rather than just feature delivery.\n- Validated learning over working software: Following the next evolution of Agile, progress is defined by the continuous process of learning what to build through experiments and feedback.\n- Mitigate four major risks early: Systematically address value (will they buy?), usability (can they use?), feasibility (can we build?), and business viability before high-cost development begins.\n- Don't fly blind (Mandatory Instrumentation): Integrating metrics, product instrumentation, and domain events into the technical solution is essential to validate hypotheses and measure actual impact.\n- Product discovery filters failed ideas: Given that even top companies like Microsoft and Amazon find that 50–66% of ideas fail to improve metrics, discovery is the only way to go fast by reducing waste.\n- Modular architecture aligned with autonomy: System design should follow team topologies to allow autonomous squads to experiment independently with a reduced \"blast radius\" for potential failures.\n- Slicing for feedback and risk management: Break down product and technical dimensions into the smallest possible batches to achieve rapid feedback and manage the cost of failure.\n- Rapid prototyping and no-code solutions: Leverage APIs, hooks, and no-code tools to validate assumptions quickly, ensuring high-cost production software is only built for proven ideas.\n",
    "key_points_es": "- El software es un pasivo a minimizar: Es extremadamente caro de construir, mantener y evolucionar; trátalo como inventario costoso que consume carga cognitiva y capacidad en lugar de un activo.\n- Enfoque en outcomes sobre outputs: El éxito se mide por impacto real, valor y cambios en comportamiento de usuario, no por funcionalidades, story points o cantidad de código entregado.\n- Ingenieros empoderados impulsan innovación: Los ingenieros son la mejor fuente única de innovación y deben ser partners colaborativos en descubrir qué construir, no solo \"code monkeys\" ejecutando requirements predefinidos.\n- El ciclo vicioso del software: Cada línea de código añadida incrementa mantenimiento y carga cognitiva; si no se gestiona, esta deuda eventualmente consume toda la capacidad de innovación.\n- Desacoplar deployment de release: Usar feature flags para separar deployments técnicos de código de decisiones de release de negocio, habilitando experimentación más segura y frecuente.\n- La arquitectura debe facilitar discovery: Los sistemas técnicos deben diseñarse para priorizar aprendizaje, optionality y bajos costes de experimentación en lugar de solo entrega de features.\n- Validated learning sobre working software: Siguiendo la siguiente evolución de Agile, el progreso se define por el proceso continuo de aprender qué construir mediante experimentos y feedback.\n- Mitigar cuatro riesgos mayores temprano: Abordar sistemáticamente valor (¿comprarán?), usabilidad (¿pueden usarlo?), feasibility (¿podemos construirlo?) y viabilidad de negocio antes de que comience desarrollo de alto coste.\n- No volar a ciegas (Instrumentación obligatoria): Integrar métricas, product instrumentation y domain events en la solución técnica es esencial para validar hipótesis y medir impacto real.\n- Product discovery filtra ideas fallidas: Dado que incluso empresas top como Microsoft y Amazon encuentran que el 50–66% de ideas fallan en mejorar métricas, discovery es la única forma de ir rápido reduciendo desperdicio.\n- Arquitectura modular alineada con autonomía: El diseño del sistema debe seguir team topologies para permitir que squads autónomos experimenten independientemente con un \"blast radius\" reducido para fallos potenciales.\n- Slicing para feedback y gestión de riesgos: Dividir dimensiones de producto y técnicas en los batches más pequeños posibles para lograr rapid feedback y gestionar el coste del fallo.\n- Rapid prototyping y soluciones no-code: Aprovechar APIs, hooks y herramientas no-code para validar assumptions rápidamente, asegurando que el software de producción de alto coste solo se construye para ideas probadas.\n"
  },
  {
    "year": "2020",
    "date": null,
    "blog": "https://www.eferro.net/2020/03/scalability-basics-application-to.html",
    "video": "https://youtu.be/yPqHK5fjJ10",
    "presentation": "https://docs.google.com/presentation/d/1cY3VOqlZ_Q-BlBIAk4oFWNR1f5-_dACvpE9qMLmgqCI/edit",
    "place": "Caceres Devops Days",
    "coauthors": null,
    "last_modified": "29/12/2025 7:01pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "Escalabilidad: bases y aplicación a sistemas, equipos y procesos",
    "name_es": "Escalabilidad: bases y aplicación a sistemas, equipos y procesos",
    "description_en": "This talk explores the fundamental mental models of scalability, including Amdahl's Law, the Universal Scalability Law, and Queueing Theory, while demonstrating how to apply these principles to optimize both technical systems and organizational teams.",
    "description_es": "Esta charla explora los modelos mentales fundamentales de escalabilidad, incluyendo la Ley de Amdahl, la Universal Scalability Law y Queueing Theory, mientras demuestra cómo aplicar estos principios para optimizar tanto sistemas técnicos como equipos organizacionales.",
    "key_learning_en": "True scalability is limited by the universal costs of contention and coordination, which apply equally to software systems and human teams. Success requires applying mental models like the Universal Scalability Law and Queueing Theory to identify bottlenecks and prioritize flow optimization over simply adding more resources, ensuring that increased load does not lead to system degradation.",
    "key_learning_es": "La verdadera escalabilidad está limitada por los costes universales de contention y coordination, que aplican igualmente a sistemas de software y equipos humanos. El éxito requiere aplicar modelos mentales como la Universal Scalability Law y Queueing Theory para identificar bottlenecks y priorizar optimización de flujo sobre simplemente añadir más recursos, asegurando que el incremento de carga no conduzca a degradación del sistema.",
    "key_points_en": "- Scalability is the capacity of a system to handle growing load by adding resources, whereas performance focuses on the latency or speed of individual requests,.\n- Linear scalability is a theoretical ideal that does not exist in practice because no system or team is 100% efficient at distributing resources without overhead,.\n- Amdahl's Law highlights the Contention Factor, which measures the time lost waiting in queues for shared resources that cannot be parallelized,.\n- The Universal Scalability Law introduces the Coherence Factor, representing the time lost when parallel processes must coordinate to achieve a common view; this can cause throughput to actually decrease as more resources are added,.\n- Queueing Theory shows that waiting times increase exponentially as system utilization nears 100%; once utilization exceeds 80%, system degradation is rapid and leads to near-infinite wait times,.\n- High variability in task duration significantly degrades queue performance, making it necessary to scale much earlier than in low-variability systems,.\n- Little's Law states that Lead Time equals Work in Progress (WIP) divided by Throughput; therefore, the most effective way to reduce delivery time is to limit the number of parallel tasks,.\n- These mathematical models apply equally to software systems and human teams; organizational bottlenecks like centralized approvals or specialized knowledge siloes act as contention and coherence penalties,.\n- Efficient scaling requires prioritizing flow optimization over resource utilization, as keeping everyone \"busy\" at 100% capacity actually stops the flow of work,.\n- Practical strategies for better scaling include implementing self-service platforms, minimizing team dependencies, and using pair programming to spread knowledge and reduce WIP,.\n- Engineering designs should be stress-tested through mental exercises by considering how the system would handle 2x, 20x, or 100x the current load to identify future technology limits,.\n",
    "key_points_es": "- La escalabilidad es la capacidad de un sistema para manejar carga creciente añadiendo recursos, mientras que el performance se enfoca en la latencia o velocidad de requests individuales.\n- La escalabilidad lineal es un ideal teórico que no existe en la práctica porque ningún sistema o equipo es 100% eficiente distribuyendo recursos sin overhead.\n- La Ley de Amdahl destaca el Contention Factor, que mide el tiempo perdido esperando en colas por recursos compartidos que no pueden paralelizarse.\n- La Universal Scalability Law introduce el Coherence Factor, representando el tiempo perdido cuando procesos paralelos deben coordinarse para lograr una vista común; esto puede causar que el throughput en realidad disminuya conforme se añaden más recursos.\n- Queueing Theory muestra que los tiempos de espera incrementan exponencialmente conforme la utilización del sistema se acerca al 100%; una vez que la utilización excede el 80%, la degradación del sistema es rápida y conduce a tiempos de espera casi infinitos.\n- La alta variabilidad en duración de tareas degrada significativamente el rendimiento de las colas, haciendo necesario escalar mucho antes que en sistemas de baja variabilidad.\n- Little's Law establece que Lead Time es igual a Work in Progress (WIP) dividido entre Throughput; por lo tanto, la forma más efectiva de reducir tiempo de entrega es limitar el número de tareas paralelas.\n- Estos modelos matemáticos aplican igualmente a sistemas de software y equipos humanos; bottlenecks organizacionales como aprobaciones centralizadas o silos de conocimiento especializado actúan como penalizaciones de contention y coherence.\n- El escalado eficiente requiere priorizar optimización de flujo sobre utilización de recursos, ya que mantener a todos \"ocupados\" al 100% de capacidad en realidad detiene el flujo de trabajo.\n- Estrategias prácticas para mejor escalado incluyen implementar platforms de self-service, minimizar dependencias de equipos y usar pair programming para difundir conocimiento y reducir WIP.\n- Los diseños de ingeniería deben ser stress-tested mediante ejercicios mentales considerando cómo el sistema manejaría 2x, 20x o 100x la carga actual para identificar límites tecnológicos futuros.\n"
  },
  {
    "year": "2019",
    "date": null,
    "blog": "https://www.eferro.net/2019/11/agile-en-que-te-hemos-convertido.html",
    "video": "https://youtu.be/ssmNo3hf5cs",
    "presentation": "https://docs.google.com/presentation/d/1dLfXHPTCoGjldoKRBGuznJTDapa9I6FF2SRInmKEbsA/edit?usp=sharing",
    "place": "CAS",
    "coauthors": "Juanma Gómez",
    "last_modified": "29/12/2025 7:08pm",
    "core": false,
    "talk_language": "Spanish",
    "name_en": "Agile, ¿En qué te hemos convertido?",
    "name_es": "Agile, ¿En qué te hemos convertido?",
    "description_en": "This talk offers a critical reflection on the software industry's superficial adoption of Agile, advocating for a return to technical excellence, continuous delivery, and Lean Product Management as the essential pillars of true business success.",
    "description_es": "Esta charla ofrece una reflexión crítica sobre la adopción superficial de Agile en la industria del software, abogando por un retorno a la excelencia técnica, continuous delivery y Lean Product Management como pilares esenciales del verdadero éxito de negocio.",
    "key_learning_en": "True business agility is only achievable when technical excellence and engineering practices like Continuous Delivery are deeply integrated with Lean product management, ensuring that organizations focus on both doing the right thing and doing it right. Someone should remember that Agile cannot exist without its engineering roots, and moving beyond superficial certifications toward a culture of responsibility and coherence is essential to prevent \"screwing up\" the sector again.\nTo understand this concept, think of a high-performance race car: a world-class driver (Agile management) is useless if the engine (Technical Excellence) isn't built to handle the speed and the mechanics (Engineering Practices) aren't constantly fine-tuning it for the track.",
    "key_learning_es": "La verdadera agilidad de negocio solo es alcanzable cuando la excelencia técnica y prácticas de ingeniería como Continuous Delivery están profundamente integradas con Lean product management, asegurando que las organizaciones se enfoquen tanto en hacer lo correcto como en hacerlo bien. Alguien debe recordar que Agile no puede existir sin sus raíces de ingeniería, y avanzar más allá de certificaciones superficiales hacia una cultura de responsabilidad y coherencia es esencial para evitar \"joderlo\" de nuevo en el sector.\nPara entender este concepto, piensa en un coche de carreras de alto rendimiento: un piloto de clase mundial (gestión Agile) es inútil si el motor (Technical Excellence) no está construido para manejar la velocidad y los mecánicos (Engineering Practices) no están constantemente ajustándolo para la pista.",
    "key_points_en": "- Strategic Shift of IT: Evolution of IT from a cost/support center focused on projects and outsourcing to a strategic business core focused on products and insourcing.\n- The Science of Performance: High-performing technology organizations are twice as likely to exceed profitability, market share, and productivity goals, as validated by the DORA/Accelerate research.\n- Four Key Metrics for Elite Performance: Success is measured through deployment frequency (on-demand), lead time for changes (less than one day), time to restore service (less than one hour), and low change failure rates.\n- The Two Pillars of Business Agility: Achievement requires both \"doing the right thing\" (Lean Product Management/Discovery) and \"doing the thing right\" (Technical Excellence/Continuous Delivery).\n- The \"Fake Agile\" Crisis: While 88% of organizations claim to have adopted Agile, only 26% have broadly adopted test automation, leading to superficial transformations without engineering substance.\n- Integration of Engineering and Product: True agility is impossible without Agile software delivery; technical practices (XP, DevOps, TDD) must be deeply integrated with product strategy.\n- Continuous Delivery as a Driver: Using continuous delivery as the \"common thread\" forces the removal of silos (Dev, Ops, QA, Product) and mandates the adoption of necessary engineering rigor.\n- Critique of Superficial Certifications: Expertise in roles like Scrum Master or Agile Coach cannot be achieved through short 16–24 hour courses; these roles require deep responsibility and coherence rather than just certification.\n- Multidisciplinary Ownership: Transitioning from \"code monkeys\" to \"product engineers\" who understand context, impact, and the final customer, sharing total ownership of the product outcome.\n- Organizational Transformation Strategy: Successful change involves identifying real stakeholders, choosing contrastable metrics, and prioritizing technical excellence to avoid \"software rot\" and unsustainable delivery speeds.\n",
    "key_points_es": "- Cambio estratégico de IT: Evolución de IT desde un centro de costes/soporte enfocado en proyectos y outsourcing hacia un core estratégico de negocio enfocado en productos e insourcing.\n- La ciencia del rendimiento: Las organizaciones tecnológicas de alto rendimiento tienen el doble de probabilidades de exceder objetivos de rentabilidad, cuota de mercado y productividad, según valida la investigación DORA/Accelerate.\n- Cuatro métricas clave para rendimiento elite: El éxito se mide mediante deployment frequency (on-demand), lead time for changes (menos de un día), time to restore service (menos de una hora) y bajos change failure rates.\n- Los dos pilares de la agilidad de negocio: El logro requiere tanto \"hacer lo correcto\" (Lean Product Management/Discovery) como \"hacerlo bien\" (Technical Excellence/Continuous Delivery).\n- La crisis del \"Fake Agile\": Mientras el 88% de las organizaciones afirman haber adoptado Agile, solo el 26% ha adoptado ampliamente test automation, conduciendo a transformaciones superficiales sin sustancia de ingeniería.\n- Integración de ingeniería y producto: La verdadera agilidad es imposible sin Agile software delivery; las prácticas técnicas (XP, DevOps, TDD) deben estar profundamente integradas con la estrategia de producto.\n- Continuous Delivery como motor: Usar continuous delivery como \"hilo conductor\" fuerza la eliminación de silos (Dev, Ops, QA, Product) y exige la adopción del rigor de ingeniería necesario.\n- Crítica a certificaciones superficiales: La expertise en roles como Scrum Master o Agile Coach no puede lograrse mediante cursos cortos de 16-24 horas; estos roles requieren responsabilidad profunda y coherencia en lugar de solo certificación.\n- Ownership multidisciplinar: Transición desde \"code monkeys\" hacia \"product engineers\" que entienden contexto, impacto y el cliente final, compartiendo ownership total del outcome del producto.\n- Estrategia de transformación organizacional: El cambio exitoso implica identificar stakeholders reales, elegir métricas contrastables y priorizar excelencia técnica para evitar \"software rot\" y velocidades de entrega insostenibles.\n"
  },
  {
    "year": "2019",
    "date": null,
    "blog": "https://www.eferro.net/2019/10/continuous-delivery-practices-and-real.html",
    "video": null,
    "presentation": "https://docs.google.com/presentation/d/1b7U-syGuID_H4fIOfnr9UtzORk1hkrRxBim9iOGxRt8/edit?usp=sharing",
    "place": "Company/Webbeds",
    "coauthors": null,
    "last_modified": "9/12/2023 10:52pm",
    "core": false,
    "talk_language": "Spanish",
    "name_en": "Continuous Delivery. Practices and Real experiences. Presentation at Webbeds",
    "name_es": "Continuous Delivery. Prácticas y experiencias reales. Presentación en Webbeds",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2019",
    "date": null,
    "blog": "https://www.eferro.net/2019/06/agile19-entrega-continua-tomandonos-la.html",
    "video": null,
    "presentation": "https://docs.google.com/presentation/d/1IQSW1M5GoGOIccZ2EP0dPJwz_6isMO6hXp5GsMhWPCE/edit?usp=sharing",
    "place": "Agile19",
    "coauthors": null,
    "last_modified": "9/12/2023 10:53pm",
    "core": false,
    "talk_language": "Spanish",
    "name_en": "Entrega Continua / Tomándonos la agilidad en serio",
    "name_es": "Entrega Continua / Tomándonos la agilidad en serio",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2019",
    "date": null,
    "blog": "https://www.eferro.net/2019/03/talk-devops-is-not-what-you-think.html",
    "video": "https://www.youtube.com/watch?v=Nf9rXACyA0g",
    "presentation": "https://docs.google.com/presentation/d/129rqQu8UmdhGWjaZFSOLHsEH0EVA9RNSDxhoCQBFKdg/edit?usp=sharing",
    "place": "MadridDevOps Cabify Forward",
    "coauthors": null,
    "last_modified": "29/12/2025 7:21pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "DevOps no es lo que crees",
    "name_es": "DevOps no es lo que crees",
    "description_en": "This talk explores DevOps as a cultural mindset rather than just a set of tools, defining it as an end-to-end vision of the value stream that leverages Agile principles to achieve sustainable continuous delivery.",
    "description_es": "Esta charla explora DevOps como un mindset cultural en lugar de solo un conjunto de herramientas, definiéndolo como una visión end-to-end del value stream que aprovecha principios Agile para lograr continuous delivery sostenible.",
    "key_learning_en": "DevOps is fundamentally a cultural mindset focused on an end-to-end vision of the value stream rather than a specific set of tools or job roles. This approach leverages Agile and Lean principles to foster cross-functional collaboration and continuous delivery, ensuring that teams prioritize fast feedback loops and ongoing learning to deliver constant value to the customer.",
    "key_learning_es": "DevOps es fundamentalmente un mindset cultural enfocado en una visión end-to-end del value stream en lugar de un conjunto específico de herramientas o roles de trabajo. Este enfoque aprovecha principios Agile y Lean para fomentar colaboración cross-funcional y continuous delivery, asegurando que los equipos prioricen fast feedback loops y aprendizaje continuo para entregar valor constante al cliente.",
    "key_points_en": "- DevOps is a mindset and cultural movement, not a specific job title, a toolset, or a specialized department,.\n- It represents an end-to-end vision of the value stream, extending Agile principles from the initial customer idea through to software running in production,.\n- The core objective is to optimize the entire flow of value and eliminate the \"walls of confusion\" between business, development, and operations,.\n- Key pillars include cross-functional collaboration, creating fast feedback loops, and fostering a culture of experimentation and continuous learning,.\n- Developers on-call is a vital practice to ensure code is \"production-ready\" by sharing operational responsibility and incentivizing high-quality code,.\n- Infrastructure Automation focuses on treating infrastructure as code and utilizing immutable infrastructure and containers to ensure consistency,.\n- Organizations should provide a Self-Service Platform that gives delivery teams the autonomy to deploy and operate their own services without waiting for external intervention,.\n- Design for Failure involves embracing the fact that complex systems will fail; the focus should be on Mean Time to Recovery (MTTR) and resilience patterns rather than just prevention,.\n- Continuous Delivery requires working in small batches with automated testing to achieve a sustainable, high-frequency deployment flow,.\n- Technical deployment (moving code to production) must be decoupled from the business release (making features available to users) through mechanisms like feature toggles,.\n- Performance is measured through four key metrics: deployment frequency, lead time for changes, time to restore service, and change failure rate,.\n- Avoid creating \"DevOps Teams\" that act as new silos; instead, establish platform teams that provide tools and mentorship to empower delivery teams,.\n",
    "key_points_es": "- DevOps es un mindset y movimiento cultural, no un job title específico, un toolset o un departamento especializado.\n- Representa una visión end-to-end del value stream, extendiendo principios Agile desde la idea inicial del cliente hasta el software corriendo en producción.\n- El objetivo core es optimizar el flujo completo de valor y eliminar los \"muros de confusión\" entre negocio, desarrollo y operaciones.\n- Los pilares clave incluyen colaboración cross-funcional, crear fast feedback loops y fomentar una cultura de experimentación y continuous learning.\n- Developers on-call es una práctica vital para asegurar que el código esté \"production-ready\" compartiendo responsabilidad operacional e incentivando código de alta calidad.\n- Infrastructure Automation se enfoca en tratar infraestructura como código y utilizar immutable infrastructure y containers para asegurar consistencia.\n- Las organizaciones deben proveer una Self-Service Platform que dé a los equipos de entrega autonomía para hacer deploy y operar sus propios servicios sin esperar intervención externa.\n- Design for Failure implica abrazar el hecho de que los sistemas complejos fallarán; el enfoque debe estar en Mean Time to Recovery (MTTR) y resilience patterns en lugar de solo prevención.\n- Continuous Delivery requiere trabajar en small batches con testing automatizado para lograr un flujo de deployment sostenible de alta frecuencia.\n- El deployment técnico (mover código a producción) debe desacoplarse del release de negocio (hacer features disponibles a usuarios) mediante mecanismos como feature toggles.\n- El rendimiento se mide mediante cuatro métricas clave: deployment frequency, lead time for changes, time to restore service y change failure rate.\n- Evitar crear \"DevOps Teams\" que actúen como nuevos silos; en su lugar, establecer platform teams que provean herramientas y mentoría para empoderar a los equipos de entrega.\n"
  },
  {
    "year": "2019",
    "date": null,
    "blog": "https://www.eferro.net/2019/01/bilbostack-2019devops-is-not-what-you.html",
    "video": null,
    "presentation": "https://docs.google.com/presentation/d/1hZKnGj-52EVlcm8qFK2WeQ01h4KLUyOh1xB8Aut7tiY/edit?usp=sharing",
    "place": "Bilbostack",
    "coauthors": null,
    "last_modified": "9/12/2023 10:59pm",
    "core": false,
    "talk_language": "Spanish",
    "name_en": "DevOps no es lo que crees",
    "name_es": "DevOps no es lo que crees",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2018",
    "date": null,
    "blog": "https://www.eferro.net/2018/12/cas18-sobreviviendo-en-produccion.html",
    "video": "https://www.youtube.com/watch?v=xWJiJNbO5F8",
    "presentation": "https://docs.google.com/presentation/d/1a1WaF7XHttd60uZkUzxt40ck3GLpUS-wF-oIf6mU2TM/edit?usp=sharing",
    "place": "CAS",
    "coauthors": null,
    "last_modified": "29/12/2025 7:24pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "Sobreviviendo en producción - Gestión de incidencias y aprendizaje",
    "name_es": "Sobreviviendo en producción - Gestión de incidencias y aprendizaje",
    "description_en": "Learn how to transform production incident management into a collaborative, blameless learning process that prioritizes psychological safety and continuous system improvement.",
    "description_es": "Aprende cómo transformar la gestión de incidentes de producción en un proceso colaborativo de aprendizaje blameless que prioriza psychological safety y mejora continua del sistema.",
    "key_learning_en": "High-performing teams maintain psychological safety by adopting a blameless culture that treats production incidents as vital opportunities for collaborative learning and system hardening rather than individual punishment. By utilizing transparent tools like Blame-less Incident Reports and the Incident Commander role, organizations shift their focus toward improving resilience and reducing recovery times, ultimately building deep professional trust across the entire company.\nInvestigating a production incident is like examining a \"crime scene\" not to find a culprit to convict, but to gather the evidence necessary to redesign the environment so that the same accident can never happen again.",
    "key_learning_es": "Los equipos de alto rendimiento mantienen psychological safety adoptando una cultura blameless que trata los incidentes de producción como oportunidades vitales para aprendizaje colaborativo y hardening del sistema en lugar de castigo individual. Utilizando herramientas transparentes como Blame-less Incident Reports y el rol de Incident Commander, las organizaciones cambian su enfoque hacia mejorar resilience y reducir recovery times, construyendo finalmente confianza profesional profunda a través de toda la compañía.\nInvestigar un incidente de producción es como examinar una \"escena del crimen\" no para encontrar un culpable a condenar, sino para reunir la evidencia necesaria para rediseñar el entorno de modo que el mismo accidente nunca pueda volver a ocurrir.",
    "key_points_en": "- Psychological safety is the foundation of high-performance teams, allowing members to take risks and fail without fear of shame or retribution.\n- Shift from a traditional culture of blame and \"heroics\" to a blameless culture that treats production incidents as vital opportunities for system improvement and collective learning.\n- Assign a single Incident Commander for every event to coordinate resources, manage periodic communications, and maintain a \"War Room\" (real-time video conference) to prevent uncoordinated, random actions.\n- Utilize Blame-less Incident Reports that are updated in real-time, highly transparent, and accessible to the entire company to build trust and professional credibility.\n- Distinguish between recovering the service (restoring stability) and fixing the system (addressing the root cause); recovery should always be the immediate priority.\n- Prioritize Mean Time to Recover (MTTR) and reducing the blast radius of failures over the impossible goal of preventing all system errors.\n- Treat corrective and preventive actions as high-priority development work; if an incident occurs, improving the system or monitoring tools should be the team's next task.\n- Investigate root causes by recognizing that most failures result from a combination of multiple factors rather than a single human error.\n- Foster a culture of vulnerability where leaders lead by example, openly sharing their own past mistakes to encourage honesty and transparency within the team.\n- Follow a disciplined Hypothesis-Validation-Action loop during both the recovery and the subsequent investigation phases to ensure decisions are data-driven.\n",
    "key_points_es": "- Psychological safety es la fundación de equipos de alto rendimiento, permitiendo a los miembros tomar riesgos y fallar sin miedo a vergüenza o represalias.\n- Cambiar desde una cultura tradicional de culpa y \"heroicidades\" hacia una cultura blameless que trata los incidentes de producción como oportunidades vitales para mejora del sistema y aprendizaje colectivo.\n- Asignar un único Incident Commander para cada evento para coordinar recursos, gestionar comunicaciones periódicas y mantener una \"War Room\" (videoconferencia en tiempo real) para prevenir acciones descoordinadas y aleatorias.\n- Utilizar Blame-less Incident Reports que se actualizan en tiempo real, son altamente transparentes y accesibles para toda la compañía para construir confianza y credibilidad profesional.\n- Distinguir entre recuperar el servicio (restaurar estabilidad) y arreglar el sistema (abordar la root cause); recovery siempre debe ser la prioridad inmediata.\n- Priorizar Mean Time to Recover (MTTR) y reducir el blast radius de fallos sobre el objetivo imposible de prevenir todos los errores del sistema.\n- Tratar acciones correctivas y preventivas como trabajo de desarrollo de alta prioridad; si ocurre un incidente, mejorar el sistema o herramientas de monitoring debe ser la siguiente tarea del equipo.\n- Investigar root causes reconociendo que la mayoría de fallos resultan de una combinación de múltiples factores en lugar de un único error humano.\n- Fomentar una cultura de vulnerabilidad donde los líderes lideren con el ejemplo, compartiendo abiertamente sus propios errores pasados para alentar honestidad y transparencia dentro del equipo.\n- Seguir un loop disciplinado de Hypothesis-Validation-Action durante tanto las fases de recovery como de investigación subsecuente para asegurar que las decisiones sean data-driven.\n"
  },
  {
    "year": "2018",
    "date": null,
    "blog": "https://www.eferro.net/2018/11/slides-taller-parallel-changes.html",
    "video": null,
    "presentation": "https://docs.google.com/presentation/d/18M0HUPoyqtA6FUVJ4E7pl-mDWl5zohxgaST2kz4RMUc/edit?usp=sharing",
    "place": "CommitConf",
    "coauthors": null,
    "last_modified": "9/12/2023 11:06pm",
    "core": false,
    "talk_language": "Spanish",
    "name_en": "Taller Cambios Paralelos",
    "name_es": "Taller Cambios Paralelos",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2018",
    "date": null,
    "blog": "https://www.eferro.net/2018/10/slides-taller-parallel-changes.html",
    "video": null,
    "presentation": "https://docs.google.com/presentation/d/1hdTxTzIqinCEtBVYf5Fg3MGStvacx8PZItFVk0Wn6nE/edit?usp=sharing",
    "place": "BarcelonaSoftwareCrafters",
    "coauthors": null,
    "last_modified": "9/12/2023 11:07pm",
    "core": false,
    "talk_language": "Spanish",
    "name_en": "Taller Cambios Paralelos",
    "name_es": "Taller Cambios Paralelos",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2018",
    "date": null,
    "blog": "https://www.eferro.net/2018/03/recursos-talleres-factory-startup.html",
    "video": null,
    "presentation": "https://docs.google.com/presentation/d/1KNSUmYjQd8TRZpbIxUftrL0Xwgx3pFHXDYjEMzXG4Vs/edit?usp=sharing",
    "place": "Factory Startup Valencia",
    "coauthors": null,
    "last_modified": "9/12/2023 11:09pm",
    "core": false,
    "talk_language": "Spanish",
    "name_en": "Talleres Factory Startup Valencia (Cambios Paralelo, Kata Fitness Functions, Architecture Kata)",
    "name_es": "Talleres Factory Startup Valencia (Cambios Paralelo, Kata Fitness Functions, Architecture Kata)",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2018",
    "date": null,
    "blog": "https://www.eferro.net/2018/03/slides-taller-parallel-changes-we-code.html",
    "video": null,
    "presentation": "https://docs.google.com/presentation/d/1GR6koBJZ5QbFoXJdemOebAGMjYhkUegTFRDI9gmz3yA/edit?usp=sharing",
    "place": "WeCode",
    "coauthors": null,
    "last_modified": "9/12/2023 11:11pm",
    "core": false,
    "talk_language": "Spanish",
    "name_en": "Taller Cambios Paralelos",
    "name_es": "Taller Cambios Paralelos",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2018",
    "date": null,
    "blog": "https://www.eferro.net/2018/02/slides-taller-parallel-changes-software.html",
    "video": null,
    "presentation": "https://docs.google.com/presentation/d/1KqpycV_Z8zUD0PoHAUb8IDOaQwokzAXa1kbjkzTZvo8/edit?usp=sharing",
    "place": "Software Crafters Madrid",
    "coauthors": null,
    "last_modified": "9/12/2023 11:14pm",
    "core": false,
    "talk_language": "Spanish",
    "name_en": "Taller Cambios Paralelos",
    "name_es": "Taller Cambios Paralelos",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2018",
    "date": null,
    "blog": "https://www.eferro.net/2018/01/code-continious-delivery-germinando-una.html",
    "video": "https://youtu.be/hbggtXmQcf8",
    "presentation": "https://docs.google.com/presentation/d/1RWC2p-shEORiixTpmRZiJZu35UJJWvuCvpfmjHNpC8k/edit?usp=sharing",
    "place": "Comunidad CODE",
    "coauthors": null,
    "last_modified": "29/12/2025 7:28pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "Continuous Delivery Germinando una cultura Ágil moderna",
    "name_es": "Continuous Delivery Germinando una cultura Ágil moderna",
    "description_en": "This talk presents a systematic approach to germinating a modern Agile culture where Continuous Delivery is treated as a fundamental tool for risk management and technical excellence, focusing on the frequent delivery of small value increments to drive business outcomes.",
    "description_es": "Esta charla presenta un enfoque sistemático para germinar una cultura Agile moderna donde Continuous Delivery se trata como herramienta fundamental para gestión de riesgo y excelencia técnica, enfocándose en la entrega frecuente de incrementos de valor pequeños para impulsar resultados de negocio.",
    "key_learning_en": "Modern agility is fundamentally about managing risk and adaptability by systematically identifying and removing bottlenecks in the value flow to enable the frequent release of small, validated increments. To sustain this, organizations must integrate technical excellence and continuous learning into their core culture, treating Continuous Delivery and technical practices as essential pillars for navigating complex business environments.",
    "key_learning_es": "La agilidad moderna trata fundamentalmente sobre gestionar riesgo y adaptabilidad identificando y eliminando sistemáticamente bottlenecks en el flujo de valor para permitir el release frecuente de incrementos pequeños validados. Para sostener esto, las organizaciones deben integrar excelencia técnica y continuous learning en su cultura core, tratando Continuous Delivery y prácticas técnicas como pilares esenciales para navegar entornos de negocio complejos.",
    "key_points_en": "- Agility is primarily risk management and adaptability, defined by the frequent delivery of small, validated increments to minimize the time value remains at risk.\n- Systematic flow improvement requires identifying the single current bottleneck in the value stream using the Theory of Constraints and addressing it before attempting to increase the overall pace.\n- Modern agility requires technical excellence; organizational frameworks like Scrum are insufficient if they are not supported by strong technical practices from Extreme Programming (XP) and DevOps.\n- Continuous Delivery requires specific performance targets, including a fast (ideally <15 min) commit-to-production cycle, 100% reliable automation, and zero-downtime deployments.\n- Trunk-Based Development is essential for integration, requiring all developers to merge their work into the main branch at least once a day to ensure small increments and high team cohesion.\n- Automated testing (TDD/BDD) must focus on confidence, prioritizing the long-term sustainability of the codebase over arbitrary metrics like test coverage.\n- Clean Code and Evolutionary Architecture are strategic assets that prevent development speed from collapsing as the system grows, allowing for constant, incremental change.\n- Decouple technical deployment from business release by using Feature Toggles and Parallel Changes to manage risk and allow for dark launching or beta testing.\n- Cultivate a blame-free learning environment through \"blame-less post-mortems,\" pair programming, and sharing operational pain (e.g., developers on-call) to drive systemic improvements.\n- Focus on business outcomes rather than outputs, necessitating that developers deeply understand the business domain and focus on changing user behavior rather than just writing lines of code.\n- Acknowledge the \"Complex\" nature of software, which requires an experimental \"probe-sense-respond\" approach to navigate unknown variables and emergent practices.\n",
    "key_points_es": "- La agilidad es primariamente gestión de riesgo y adaptabilidad, definida por la entrega frecuente de incrementos pequeños validados para minimizar el tiempo que el valor permanece en riesgo.\n- La mejora sistemática de flujo requiere identificar el único bottleneck actual en el value stream usando la Theory of Constraints y abordarlo antes de intentar incrementar el ritmo general.\n- La agilidad moderna requiere excelencia técnica; frameworks organizacionales como Scrum son insuficientes si no están soportados por prácticas técnicas fuertes de Extreme Programming (XP) y DevOps.\n- Continuous Delivery requiere objetivos específicos de rendimiento, incluyendo un ciclo commit-to-production rápido (idealmente <15 min), automatización 100% confiable y deployments de zero-downtime.\n- Trunk-Based Development es esencial para integración, requiriendo que todos los desarrolladores hagan merge de su trabajo al main branch al menos una vez al día para asegurar incrementos pequeños y alta cohesión de equipo.\n- El testing automatizado (TDD/BDD) debe enfocarse en confianza, priorizando la sostenibilidad a largo plazo del codebase sobre métricas arbitrarias como test coverage.\n- Clean Code y Evolutionary Architecture son activos estratégicos que previenen que la velocidad de desarrollo colapse conforme el sistema crece, permitiendo cambio constante e incremental.\n- Desacoplar deployment técnico de release de negocio usando Feature Toggles y Parallel Changes para gestionar riesgo y permitir dark launching o beta testing.\n- Cultivar un entorno de aprendizaje blame-free mediante \"blame-less post-mortems\", pair programming y compartir dolor operacional (ej. developers on-call) para impulsar mejoras sistémicas.\n- Enfocarse en business outcomes en lugar de outputs, requiriendo que los desarrolladores entiendan profundamente el dominio de negocio y se enfoquen en cambiar comportamiento de usuario en lugar de solo escribir líneas de código.\n- Reconocer la naturaleza \"Compleja\" del software, que requiere un enfoque experimental \"probe-sense-respond\" para navegar variables desconocidas y prácticas emergentes.\n"
  },
  {
    "year": "2017",
    "date": null,
    "blog": "https://www.eferro.net/2017/11/agilidad-hacia-la-entrega-continua-que.html",
    "video": "https://youtu.be/jC96gFXCo2A",
    "presentation": "https://docs.google.com/presentation/d/170wNb6Ut1ZiU2RT_bzK_QPjzHd1Pl04SU5zFldP166M/edit#slide=id.p3",
    "place": "CAS",
    "coauthors": null,
    "last_modified": "29/12/2025 7:35pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "Agilidad. Hacia la entrega continua. ¿Qué te lo impide?",
    "name_es": "Agilidad. Hacia la entrega continua. ¿Qué te lo impide?",
    "description_en": "This talk explains how technical excellence through XP and DevOps practices serves as the essential foundation for achieving sustainable agility and continuous delivery, shifting the focus from speed to risk management and adaptivity.",
    "description_es": "Esta charla explica cómo la excelencia técnica mediante prácticas XP y DevOps sirve como fundación esencial para lograr agilidad sostenible y continuous delivery, cambiando el enfoque desde velocidad hacia gestión de riesgo y adaptabilidad.",
    "key_learning_en": "Agility is fundamentally about managing risk and increasing adaptivity through continuous delivery and small, validated increments rather than merely pursuing development speed. To achieve this sustainably, organizations must ground their management frameworks in technical excellence by integrating Extreme Programming (XP) and DevOps practices that ensure long-term code quality and reliable, automated deployment.",
    "key_learning_es": "La agilidad es fundamentalmente sobre gestionar riesgo e incrementar adaptabilidad mediante continuous delivery e incrementos pequeños validados en lugar de meramente perseguir velocidad de desarrollo. Para lograr esto de forma sostenible, las organizaciones deben fundamentar sus frameworks de gestión en excelencia técnica integrando prácticas de Extreme Programming (XP) y DevOps que aseguren calidad de código a largo plazo y deployment automatizado confiable.",
    "key_points_en": "- Agility is about risk management and adaptability, not just speed. High-frequency delivery reduces the volume of risk by validating technical and business hypotheses in small increments.\n- Continuous Delivery is the ultimate goal of agility, requiring a fully automated deployment pipeline where code can go from commit to production in under 15 minutes.\n- Technical excellence is the foundation of sustainability. Frameworks like Scrum are valuable for management but insufficient without the technical practices of Extreme Programming (XP) and DevOps.\n- Decouple \"Deployment\" from \"Release.\" Use techniques like Feature Toggles and Parallel Change to deploy code continuously for technical validation without necessarily exposing unfinished features to the end user.\n- Continuous Integration means committing to the trunk daily. Long-lived feature branches create \"merge pain\" and prevent opportunistic refactoring; Trunk-Based Development is preferred for team synchronization.\n- The primary goal of testing is confidence. Automated tests (TDD/BDD) must be sustainable over time to ensure that passing the suite means the code is ready for production.\n- Clean code and decoupled architecture are prerequisites for agility. Without them, automated testing becomes impossible, and the \"Design Stamina\" required for long-term product evolution collapses.\n- DevOps is about reliability and fast recovery. It requires automated infrastructure, deployment without service loss (Blue-Green/Canary), and robust business/technical metrics for immediate feedback.\n- Pair Programming facilitates knowledge distribution. Since software development is a knowledge-based profession, pairing ensures learning is continuous and the team matures together.\n- Agility acts as a stress test for quality. Increasing deployment frequency exposes hidden bottlenecks and \"trash\" in the system, forcing the organization to invest in automation and mentoring rather than hiding behind long release cycles.\n- Shift the IT paradigm from \"Cost Center\" to \"Innovation and Benefit.\" In a world where software is a core business driver, technical debt acts as a hostage-taker for the entire company's pace of change.\n",
    "key_points_es": "- La agilidad trata sobre gestión de riesgo y adaptabilidad, no solo velocidad. La entrega de alta frecuencia reduce el volumen de riesgo validando hipótesis técnicas y de negocio en incrementos pequeños.\n- Continuous Delivery es el objetivo último de la agilidad, requiriendo un pipeline de deployment completamente automatizado donde el código puede ir desde commit a producción en menos de 15 minutos.\n- La excelencia técnica es la fundación de la sostenibilidad. Frameworks como Scrum son valiosos para gestión pero insuficientes sin las prácticas técnicas de Extreme Programming (XP) y DevOps.\n- Desacoplar \"Deployment\" de \"Release\". Usar técnicas como Feature Toggles y Parallel Change para hacer deploy de código continuamente para validación técnica sin necesariamente exponer features inacabadas al usuario final.\n- Continuous Integration significa hacer commit al trunk diariamente. Los feature branches de larga duración crean \"merge pain\" y previenen refactoring oportunista; Trunk-Based Development es preferido para sincronización de equipo.\n- El objetivo principal del testing es confianza. Los tests automatizados (TDD/BDD) deben ser sostenibles en el tiempo para asegurar que pasar la suite significa que el código está listo para producción.\n- Clean code y arquitectura desacoplada son prerequisitos para agilidad. Sin ellos, el testing automatizado se vuelve imposible y el \"Design Stamina\" requerido para evolución de producto a largo plazo colapsa.\n- DevOps trata sobre confiabilidad y fast recovery. Requiere infraestructura automatizada, deployment sin pérdida de servicio (Blue-Green/Canary) y métricas robustas de negocio/técnicas para feedback inmediato.\n- Pair Programming facilita distribución de conocimiento. Dado que el desarrollo de software es una profesión basada en conocimiento, hacer pairing asegura que el aprendizaje sea continuo y el equipo madure junto.\n- La agilidad actúa como stress test para calidad. Incrementar deployment frequency expone bottlenecks ocultos y \"basura\" en el sistema, forzando a la organización a invertir en automatización y mentoría en lugar de esconderse detrás de ciclos de release largos.\n- Cambiar el paradigma de IT desde \"Cost Center\" a \"Innovación y Beneficio\". En un mundo donde el software es un driver core de negocio, el tech debt actúa como secuestrador del ritmo de cambio de toda la compañía.\n"
  },
  {
    "year": "2017",
    "date": null,
    "blog": "https://www.eferro.net/2017/10/charla-acelerando-la-cultura-devops.html",
    "video": null,
    "presentation": "https://docs.google.com/presentation/d/1nHxLxAq6rNkILNM4fsV0jEvXOeBgJWORAHpCLwHPXpk/edit#slide=id.p3",
    "place": "DEVOPS SPAIN",
    "coauthors": null,
    "last_modified": "9/12/2023 11:19pm",
    "core": false,
    "talk_language": "Spanish",
    "name_en": "Acelerando la cultura DevOps usando Entrega Continua",
    "name_es": "Acelerando la cultura DevOps usando Entrega Continua",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2017",
    "date": null,
    "blog": "https://www.eferro.net/2017/10/simplicidad-para-desarrolladores.html",
    "video": "https://youtu.be/6FDxbCzh2sI",
    "presentation": "https://docs.google.com/presentation/d/1K8xLl6WH-Tpgbn_B41pFtWJhWUqQ9EMEG1LZtvWPoJ4/edit?usp=sharing",
    "place": "BarcelonaSoftwareCrafters",
    "coauthors": null,
    "last_modified": "29/12/2025 7:38pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "Simplicidad (Para Desarrolladores)",
    "name_es": "Simplicidad (Para Desarrolladores)",
    "description_en": "This talk details how developers can overcome accidental complexity by utilizing simple design rules, evolutionary architecture, and the strategic reframing of technical problems to ensure long-term system sustainability.",
    "description_es": "Esta charla detalla cómo los desarrolladores pueden superar la complejidad accidental utilizando reglas de diseño simple, arquitectura evolutiva y el replanteamiento estratégico de problemas técnicos para asegurar sostenibilidad del sistema a largo plazo.",
    "key_learning_en": "Software developers should prioritize evolutionary design and continuous refactoring to combat accidental complexity, ensuring that systems remain simple and adaptable to change by focusing on immediate business value rather than speculative future requirements. True simplicity is achieved through successive approximations and a willingness to detach from specific technical solutions in favor of maintaining a system that remains easy to understand and modify.",
    "key_learning_es": "Los desarrolladores de software deben priorizar diseño evolutivo y refactoring continuo para combatir complejidad accidental, asegurando que los sistemas permanezcan simples y adaptables al cambio enfocándose en valor de negocio inmediato en lugar de requirements futuros especulativos. La verdadera simplicidad se logra mediante aproximaciones sucesivas y disposición a desapegarse de soluciones técnicas específicas en favor de mantener un sistema que permanezca fácil de entender y modificar.",
    "key_points_en": "- Intrinsic vs. Accidental Complexity: Intrinsic complexity is inherent to the problem itself, while accidental complexity is created by developers. A simple system aims to reduce accidental complexity to zero.\n- Four Rules of Simple Design: A system is simple if it: 1. Runs all tests, 2. Reveals intention, 3. Contains no duplicated logic, and 4. Uses the fewest possible elements.\n- Evolutionary vs. Adaptable Architecture: Avoid \"adaptable\" architectures that attempt to predict and build for future extensibility. Instead, favor \"evolutionary\" architecture that accepts uncertainty and treats the system as an organic entity that grows and changes over time.\n- Strict Outside-in TDD: Use Test-Driven Development from the perspective of business needs to ensure that only the minimum necessary code is written, preventing speculative \"future-proofing.\"\n- Successive Approximations: Achieve simplicity through an iterative process. A solution is \"good enough\" if it is small, tested, understood, and ready for production feedback.\n- The Preparation Refactor: When adding a new feature, first identify how the system should look to make that feature fit naturally. Perform that refactor as a separate step before implementing the new functionality.\n- Avoid Premature Reusability: Reusability should be reserved for libraries. Application code should focus on being \"usable\" and simple; reusability can be extracted later once a pattern has clearly emerged two or three times.\n- Reframing Technical Problems: Reduce complexity by questioning the problem itself. Changing the problem can lead to radically simpler solutions (e.g., using immutable servers instead of managing server state).\n- Continuous Refactoring and Deletion: Simplicity requires constant maintenance (the \"gardening\" metaphor). Use the Boy Scout rule to leave code better than you found it and proactively delete unused features or services.\n- Emotional Detachment from Code: Developers should be passionate about quality but detached from specific technical solutions so they can easily discard or replace code when it no longer provides business value.\n- Simplicity as Hard Work: Complexity is often easier to \"sell\" or market, but achieving true simplicity requires significant effort, experience, and the strategic postponement of technical decisions.\n",
    "key_points_es": "- Complejidad intrínseca vs. accidental: La complejidad intrínseca es inherente al problema en sí, mientras que la complejidad accidental es creada por desarrolladores. Un sistema simple busca reducir la complejidad accidental a cero.\n- Cuatro reglas de Simple Design: Un sistema es simple si: 1. Ejecuta todos los tests, 2. Revela intención, 3. No contiene lógica duplicada, y 4. Usa los elementos mínimos posibles.\n- Arquitectura evolutiva vs. adaptable: Evitar arquitecturas \"adaptables\" que intentan predecir y construir para extensibilidad futura. En su lugar, favorecer arquitectura \"evolutiva\" que acepta incertidumbre y trata el sistema como entidad orgánica que crece y cambia en el tiempo.\n- TDD estricto Outside-in: Usar Test-Driven Development desde la perspectiva de necesidades de negocio para asegurar que solo se escribe el código mínimo necesario, previniendo \"future-proofing\" especulativo.\n- Aproximaciones sucesivas: Lograr simplicidad mediante proceso iterativo. Una solución es \"suficientemente buena\" si es pequeña, testeada, entendida y lista para feedback de producción.\n- El Preparation Refactor: Al añadir una nueva feature, primero identificar cómo debería lucir el sistema para que esa feature encaje naturalmente. Realizar ese refactoring como paso separado antes de implementar la nueva funcionalidad.\n- Evitar reusabilidad prematura: La reusabilidad debe reservarse para librerías. El código de aplicación debe enfocarse en ser \"usable\" y simple; la reusabilidad puede extraerse después una vez que un patrón haya emergido claramente dos o tres veces.\n- Replantear problemas técnicos: Reducir complejidad cuestionando el problema en sí. Cambiar el problema puede conducir a soluciones radicalmente más simples (ej. usar immutable servers en lugar de gestionar server state).\n- Refactoring continuo y eliminación: La simplicidad requiere mantenimiento constante (la metáfora de \"jardinería\"). Usar la Boy Scout rule para dejar código mejor de como lo encontraste y eliminar proactivamente features o servicios no usados.\n- Desapego emocional del código: Los desarrolladores deben ser apasionados por la calidad pero desapegados de soluciones técnicas específicas para poder descartar o reemplazar código fácilmente cuando ya no provee valor de negocio.\n- Simplicidad como trabajo duro: La complejidad es a menudo más fácil de \"vender\" o marketear, pero lograr verdadera simplicidad requiere esfuerzo significativo, experiencia y postponement estratégico de decisiones técnicas.\n"
  },
  {
    "year": "2017",
    "date": null,
    "blog": "https://www.eferro.net/2017/06/el-arte-del-patadon-palante-libro-de.html",
    "video": "https://youtu.be/AQK_YgFj7Ng?list=PLKxa4AIfm4pWzA2ILUMUDwD_0QGIIJetn",
    "presentation": "https://docs.google.com/presentation/d/1W1czJZkcgW7Hjy8ShyeCKSX-Kgw7Oc-g2DNCL6ZIYhY/edit",
    "place": "Pamplona Software Crafters",
    "coauthors": null,
    "last_modified": "29/12/2025 7:41pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "El arte del patadon pa'lante / Libro de recetas",
    "name_es": "El arte del patadon pa'lante / Libro de recetas",
    "description_en": "This talk shares practical \"recipes\" for evolutionary design by mastering \"the art of the kick forward\"—postponing technical decisions until the last responsible moment to maintain maximum architectural adaptability and minimize waste.",
    "description_es": "Esta charla comparte \"recetas\" prácticas para diseño evolutivo dominando \"el arte del patadon pa'lante\"—postponer decisiones técnicas hasta el último momento responsable para mantener máxima adaptabilidad arquitectónica y minimizar desperdicio.",
    "key_learning_en": "Postponing technical decisions until the last responsible moment allows teams to maintain maximum architectural adaptability and minimize waste by focusing on simple, evolving solutions rather than premature, complex designs. By prioritizing business problems over technical solutions and keeping options open, developers can implement an evolutionary design that effectively manages risk and adapts to actual needs rather than imagined ones.\nThis approach is much like navigating through a dense fog: instead of building a massive highway toward a destination you cannot yet see, you lay down just enough pavement to reach the next visible landmark, ensuring you don't waste resources building a bridge over a river that isn't actually there.",
    "key_learning_es": "Postponer decisiones técnicas hasta el último momento responsable permite a los equipos mantener máxima adaptabilidad arquitectónica y minimizar desperdicio enfocándose en soluciones simples y evolutivas en lugar de diseños complejos prematuros. Priorizando problemas de negocio sobre soluciones técnicas y manteniendo opciones abiertas, los desarrolladores pueden implementar un diseño evolutivo que gestiona riesgo efectivamente y se adapta a necesidades reales en lugar de imaginadas.\nEste enfoque es como navegar a través de una niebla densa: en lugar de construir una autopista masiva hacia un destino que aún no puedes ver, pones solo el pavimento suficiente para alcanzar el siguiente hito visible, asegurando que no desperdicias recursos construyendo un puente sobre un río que en realidad no está ahí.",
    "key_points_en": "- Postpone technical decisions until the last responsible moment to keep options open and maintain maximum architectural adaptability,.\n- Distinguish between business problems and technical solutions, ensuring the team focuses on solving business needs rather than over-engineering for imagined technical requirements,.\n- Adopt evolutionary design by implementing the simplest possible solution first—such as file serialization or manual activation—and evolving it only when actual needs arise,.\n- Minimize waste by avoiding unnecessary complexity, as much product development time is often spent undoing complexity that should never have been introduced,.\n- Consider \"doing nothing\" as a valid technical option when the engineering cost of a solution significantly outweighs the business impact of the problem,.\n- Master technical practices like parallel changes and \"Branch by Abstraction\" to allow for high-impact architectural transitions through low-risk, incremental steps,.\n- Manage risk through reversible, small-scale deployments rather than high-stakes, \"big bang\" changes or migrations,.\n- Slice problems by dimensions (such as scale, user type, or elasticity) in collaboration with product teams to justify simpler, faster technical implementations,.\n- Suppress the \"inner engineer\" urge to build complex, fun systems and focus instead on providing sustainable value to the business,.\n- Define Agility as adaptability and risk management rather than just raw delivery speed,.\n",
    "key_points_es": "- Postponer decisiones técnicas hasta el último momento responsable para mantener opciones abiertas y máxima adaptabilidad arquitectónica.\n- Distinguir entre problemas de negocio y soluciones técnicas, asegurando que el equipo se enfoque en resolver necesidades de negocio en lugar de sobre-ingeniería para requirements técnicos imaginados.\n- Adoptar diseño evolutivo implementando la solución más simple posible primero —como file serialization o activación manual— y evolucionarla solo cuando surjan necesidades reales.\n- Minimizar desperdicio evitando complejidad innecesaria, ya que mucho tiempo de desarrollo de producto a menudo se gasta deshaciendo complejidad que nunca debió introducirse.\n- Considerar \"no hacer nada\" como opción técnica válida cuando el coste de ingeniería de una solución supera significativamente el impacto de negocio del problema.\n- Dominar prácticas técnicas como parallel changes y \"Branch by Abstraction\" para permitir transiciones arquitectónicas de alto impacto mediante small, safe steps de bajo riesgo.\n- Gestionar riesgo mediante deployments reversibles de pequeña escala en lugar de cambios o migraciones \"big bang\" de alto riesgo.\n- Dividir problemas por dimensiones (como escala, tipo de usuario o elasticidad) en colaboración con equipos de producto para justificar implementaciones técnicas más simples y rápidas.\n- Suprimir el impulso del \"inner engineer\" de construir sistemas complejos y divertidos y enfocarse en proveer valor sostenible al negocio.\n- Definir Agilidad como adaptabilidad y gestión de riesgo en lugar de solo velocidad de entrega bruta.\n"
  },
  {
    "year": "2016",
    "date": null,
    "blog": "https://www.eferro.net/2016/12/el-arte-del-patadon-palante-posponer.html",
    "video": "https://youtu.be/vEr2xbNoUxM",
    "presentation": "https://docs.google.com/presentation/d/1a1ymSWVVKWU1EhN8kbrDVRV0FbLwfAJo39DFPHgYOoE/edit",
    "place": "CAS",
    "coauthors": null,
    "last_modified": "29/12/2025 7:47pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "El arte del patadon pa'lante / posponer decisiones",
    "name_es": "El arte del patadon pa'lante / posponer decisiones",
    "description_en": "This talk explores \"the art of the kick forward,\" a strategy for deferring technical and business decisions to the last responsible moment to maintain maximum flexibility, reduce accidental complexity, and focus on delivering immediate value through technical excellence.",
    "description_es": "Esta charla explora \"el arte del patadon pa'lante\", una estrategia para diferir decisiones técnicas y de negocio hasta el último momento responsable para mantener máxima flexibilidad, reducir complejidad accidental y enfocarse en entregar valor inmediato mediante excelencia técnica.",
    "key_learning_en": "To effectively manage uncertainty and deliver real value, teams should intentionally postpone decisions until the last responsible moment, which allows them to gather more knowledge and minimize accidental complexity by only solving current, validated problems. This approach requires a foundation of technical excellence—such as a decoupled architecture and continuous delivery—to ensure that the software remains simple, flexible, and easily reversible as business needs evolve.",
    "key_learning_es": "Para gestionar efectivamente incertidumbre y entregar valor real, los equipos deben intencionalmente postponer decisiones hasta el último momento responsable, lo cual les permite reunir más conocimiento y minimizar complejidad accidental resolviendo solo problemas actuales validados. Este enfoque requiere una fundación de excelencia técnica—como arquitectura desacoplada y continuous delivery—para asegurar que el software permanezca simple, flexible y fácilmente reversible conforme las necesidades de negocio evolucionan.",
    "key_points_en": "- The \"Last Responsible Moment\": Postpone technical and business decisions until the latest point possible to maintain maximum flexibility and keep options open.\n- Knowledge Growth: Recognize that knowledge about a problem increases as a project progresses; delaying a decision allows it to be made with the best possible information.\n- Minimizing Accidental Complexity: Focus on immediate needs to avoid building solutions for \"imaginary\" future problems, which minimizes code volume, maintenance costs, and unnecessary complexity.\n- Software as Inventory, Not Value: Software itself is inventory; true value is the positive business impact it creates. Zero code is the ideal if the same value can be achieved.\n- Criteria for \"Good\" Decisions: Favor choices that require low commitment, are easily reversible, and solve current problems rather than anticipated ones.\n- Evolutionary Architecture: Build systems that decouple business logic from infrastructure (e.g., using repository patterns) to allow late-stage changes to databases, frameworks, or external tools.\n- Technical Excellence is Non-Negotiable: Agile culture and technical practices (TDD, Continuous Integration/Delivery, XP) should never be postponed, as they provide the safety net required to make frequent changes.\n- Small, Simple Pieces: Avoid \"mega-constructions\" and premature abstractions; favor simple, modular code that is easy to understand, modify, or even delete.\n- Business Partnership: Engineering teams should not just \"take orders\" but act as part of the business, validating assumptions, understanding the \"why,\" and discussing costs to help prioritize high-value experiments.\n- Psychological Safety: Foster a blame-free culture where changing a past decision is seen as a natural response to new context rather than a failure.\n",
    "key_points_es": "- El \"Último Momento Responsable\": Postponer decisiones técnicas y de negocio hasta el punto más tardío posible para mantener máxima flexibilidad y mantener opciones abiertas.\n- Crecimiento del conocimiento: Reconocer que el conocimiento sobre un problema incrementa conforme un proyecto progresa; retrasar una decisión permite hacerla con la mejor información posible.\n- Minimizar complejidad accidental: Enfocarse en necesidades inmediatas para evitar construir soluciones para problemas futuros \"imaginarios\", lo cual minimiza volumen de código, costes de mantenimiento y complejidad innecesaria.\n- Software como inventario, no valor: El software en sí es inventario; el valor verdadero es el impacto positivo de negocio que crea. Cero código es el ideal si el mismo valor puede lograrse.\n- Criterios para decisiones \"buenas\": Favorecer elecciones que requieran bajo commitment, sean fácilmente reversibles y resuelvan problemas actuales en lugar de anticipados.\n- Arquitectura evolutiva: Construir sistemas que desacoplen lógica de negocio de infraestructura (ej. usando repository patterns) para permitir cambios de última etapa a bases de datos, frameworks o herramientas externas.\n- La excelencia técnica no es negociable: La cultura Agile y prácticas técnicas (TDD, Continuous Integration/Delivery, XP) nunca deben postponerse, ya que proveen la red de seguridad requerida para hacer cambios frecuentes.\n- Piezas pequeñas y simples: Evitar \"mega-construcciones\" y abstracciones prematuras; favorecer código simple y modular que sea fácil de entender, modificar o incluso eliminar.\n- Partnership de negocio: Los equipos de ingeniería no deben solo \"tomar órdenes\" sino actuar como parte del negocio, validando assumptions, entendiendo el \"por qué\" y discutiendo costes para ayudar a priorizar experimentos de alto valor.\n- Psychological Safety: Fomentar una cultura blame-free donde cambiar una decisión pasada se vea como respuesta natural a nuevo contexto en lugar de un fallo.\n"
  },
  {
    "year": "2014",
    "date": null,
    "blog": "https://www.eferro.net/2014/11/presentacion-python-herencia-vs.html",
    "video": null,
    "presentation": "https://docs.google.com/presentation/d/1QfTIhy6g_dXCxMrtchKcKgQe96-6bdSY8VOPVHwxJlk/edit?usp=sharing",
    "place": "PyConEs",
    "coauthors": null,
    "last_modified": "9/12/2023 10:48pm",
    "core": false,
    "talk_language": "Spanish",
    "name_en": "Luke soy tu padre",
    "name_es": "Luke soy tu padre",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2014",
    "date": null,
    "blog": "https://www.eferro.net/2014/11/taller-diseno-modular-dirigido-por.html",
    "video": null,
    "presentation": null,
    "place": "PyConEs",
    "coauthors": null,
    "last_modified": "9/12/2023 10:48pm",
    "core": false,
    "talk_language": "Spanish",
    "name_en": "Taller diseño modular",
    "name_es": "Taller diseño modular",
    "description_en": null,
    "description_es": null,
    "key_learning_en": null,
    "key_learning_es": null,
    "key_points_en": null,
    "key_points_es": null
  },
  {
    "year": "2013",
    "date": null,
    "blog": "https://www.eferro.net/2013/11/conferencia-pycones-2013.html",
    "video": "https://www.youtube.com/watch?v=yAAe772_GRU",
    "presentation": "https://docs.google.com/presentation/d/1MjMHaAo3gA_2TyXO-6T3WxmPtN09gFukoQsiPAtxKv4/edit?usp=sharing",
    "place": "PyConEs",
    "coauthors": "Nestor Salceda,Guillermo Pascual,Alberto Perez",
    "last_modified": "29/12/2025 7:50pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "El mejor Framework POO/SOLID (Python OO SOLID)",
    "name_es": "El mejor Framework POO/SOLID (Python OO SOLID)",
    "description_en": "This talk advocates for building evolvable software products by prioritizing pure Python Object-Oriented programming and SOLID principles over restrictive frameworks to enable agile development, emergent architecture, and a deep focus on business logic.",
    "description_es": "Esta charla defiende la construcción de productos de software evolutivos priorizando programación Orientada a Objetos pura en Python y principios SOLID sobre frameworks restrictivos para permitir desarrollo ágil, arquitectura emergente y un enfoque profundo en la lógica de negocio.",
    "key_learning_en": "Building evolvable software products requires prioritizing pure Object-Oriented programming and SOLID principles to isolate core business logic from the constraints and inevitable obsolescence of third-party frameworks. Instead of making rigid technical choices prematurely, developers should postpone decisions until the \"last responsible moment,\" using Domain-Driven Design (DDD) to ensure the software grows through emergent architecture fueled by continuous feedback and real user needs.",
    "key_learning_es": "Construir productos de software evolutivos requiere priorizar programación Orientada a Objetos pura y principios SOLID para aislar la lógica de negocio core de las restricciones y la obsolescencia inevitable de frameworks de terceros. En lugar de tomar decisiones técnicas rígidas prematuramente, los desarrolladores deben posponer decisiones hasta el \"último momento responsable\", usando Domain-Driven Design (DDD) para asegurar que el software crezca mediante arquitectura emergente alimentada por feedback continuo y necesidades reales de usuarios.",
    "key_points_en": "- Pure Python OO and SOLID principles are the \"best framework,\" offering significantly more flexibility and longevity than third-party frameworks that impose rigid, restrictive structures.\n- Separation of concerns is essential: the business logic (the domain) should be completely isolated from infrastructure \"details\" such as databases, networks, or UI delivery mechanisms.\n- Architecture should be emergent, evolving organically through continuous feedback and frequent releases rather than being locked in at the start of a project when domain knowledge is at its lowest.\n- The \"Art of Postponing Decisions\": Defer technical choices (e.g., which database to use) until the last responsible moment to ensure they are based on actual needs discovered during development.\n- Domain-Driven Design (DDD) allows the software to focus on solving the customer's business problem (e.g., fiber optics or VoIP) rather than technical or framework-specific hurdles.\n- Isolation of external libraries: Use the Wrapper or Adapter pattern to encapsulate third-party tools, preventing external dependencies from \"leaking\" into and polluting the core business logic.\n- High-speed feedback via TDD: Maintain a pure logic core that allows hundreds of unit tests to run in under a second, ensuring a sustainable and \"delicious\" development pace.\n- Contract Testing: Implement automated tests specifically for the wrappers of third-party libraries to verify their behavior and allow for safe, frequent version upgrades.\n- Long-term Product Vision: Design software to be maintainable for 10–15 years by focusing on the stable business domain rather than rapidly changing technical trends or \"fashionable\" frameworks.\n",
    "key_points_es": "- Python OO puro y principios SOLID son el \"mejor framework\", ofreciendo significativamente más flexibilidad y longevidad que frameworks de terceros que imponen estructuras rígidas y restrictivas.\n- La separación de concerns es esencial: la lógica de negocio (el dominio) debe estar completamente aislada de \"detalles\" de infraestructura como bases de datos, redes o mecanismos de entrega de UI.\n- La arquitectura debe ser emergente, evolucionando orgánicamente mediante feedback continuo y releases frecuentes en lugar de quedar bloqueada al inicio del proyecto cuando el conocimiento del dominio está en su nivel más bajo.\n- El \"Arte de Posponer Decisiones\": Diferir decisiones técnicas (por ejemplo, qué base de datos usar) hasta el último momento responsable para asegurar que se basan en necesidades reales descubiertas durante el desarrollo.\n- Domain-Driven Design (DDD) permite que el software se enfoque en resolver el problema de negocio del cliente (por ejemplo, fibra óptica o VoIP) en lugar de obstáculos técnicos o específicos de frameworks.\n- Aislamiento de librerías externas: Usar el patrón Wrapper o Adapter para encapsular herramientas de terceros, previniendo que dependencias externas \"se filtren\" y contaminen la lógica de negocio core.\n- Feedback de alta velocidad mediante TDD: Mantener un core de lógica pura que permita ejecutar cientos de unit tests en menos de un segundo, asegurando un ritmo de desarrollo sostenible y \"delicioso\".\n- Contract Testing: Implementar tests automatizados específicamente para los wrappers de librerías de terceros para verificar su comportamiento y permitir actualizaciones de versión seguras y frecuentes.\n- Visión de Producto a Largo Plazo: Diseñar software para ser mantenible durante 10-15 años enfocándose en el dominio de negocio estable en lugar de tendencias técnicas que cambian rápidamente o frameworks \"de moda\".\n"
  },
  {
    "year": "2013",
    "date": null,
    "blog": "https://www.eferro.net/2013/11/conferencia-pycones-2013.html",
    "video": "https://www.youtube.com/watch?v=9GG5sJo2400",
    "presentation": "https://docs.google.com/presentation/d/1hXH-FL3t_klRXfMxL0R5aDw07HNQAVD8_OItCprKGac/edit?usp=sharing",
    "place": "PyConEs",
    "coauthors": "Nestor Salceda,Guillermo Pascual,Alberto Perez",
    "last_modified": "29/12/2025 7:55pm",
    "core": true,
    "talk_language": "Spanish",
    "name_en": "S.O.L.I.D Python (PyConES 2013)",
    "name_es": "S.O.L.I.D Python (PyConES 2013)",
    "description_en": "This talk demonstrates how SOLID principles and agile technical practices in Python prevent system rigidity and fragility, ensuring long-term maintainability and cost-efficiency through a focus on testability and clean code.",
    "description_es": "Esta charla demuestra cómo los principios SOLID y las prácticas técnicas ágiles en Python previenen la rigidez y fragilidad del sistema, asegurando mantenibilidad a largo plazo y eficiencia de costes mediante un enfoque en testability y clean code.",
    "key_learning_en": "Applying SOLID principles and agile technical practices in Python is fundamentally a financial and professional commitment to prevent system rigidity and ensure long-term maintainability. By prioritizing clean code and testability, developers can create flexible architectures that allow for continuous evolution and lower operational costs while reducing the anxiety often associated with modifying complex systems.",
    "key_learning_es": "Aplicar principios SOLID y prácticas técnicas ágiles en Python es fundamentalmente un compromiso financiero y profesional para prevenir rigidez del sistema y asegurar mantenibilidad a largo plazo. Priorizando clean code y testability, los desarrolladores pueden crear arquitecturas flexibles que permiten evolución continua y menores costes operacionales mientras reducen la ansiedad frecuentemente asociada a modificar sistemas complejos.",
    "key_points_en": "- Software maintainability is a financial decision: Rigid, fragile, and viscous systems are expensive to maintain; applying SOLID principles is a commitment to reducing long-term operational costs and technical debt.\n- Single Responsibility Principle (SRP): Each class should have only one reason to change, meaning its responsibility should be tied to a single role or stakeholder to avoid \"God objects.\"\n- Dependency Inversion Principle (DIP): Systems should depend on abstractions rather than concrete implementations, using dependency injection to decouple high-level logic from low-level details.\n- Open/Closed Principle (OCP): Software entities should be open for extension but closed for modification; abstractions should be introduced through refactoring when a second extension point is actually needed, rather than through upfront over-engineering.\n- Liskov Substitution Principle (LSP): Derived classes must be completely substitutable for their base classes; in Python, this is best achieved by favoring composition over inheritance to avoid improper abstractions.\n- Interface Segregation Principle (ISP): Smaller, more specific interfaces are better than large, general-purpose ones, as they reduce unnecessary dependencies and improve code reusability.\n- Test-Driven Development (TDD) as a design tool: Technical practices like TDD are not just for validation but are essential for designing testable architectures that allow developers to deploy with confidence and minimal anxiety.\n- Professionalism and Clean Code: Writing clean, maintainable code is a professional responsibility that ensures a team can continue delivering features at a constant pace without the system becoming \"immobile.\"\n- Pythonic approach to SOLID: While principles remain constant, Python's dynamic nature and duck typing allow for simpler abstractions and a stronger emphasis on composition over rigid type hierarchies.\n",
    "key_points_es": "- La mantenibilidad del software es una decisión financiera: Los sistemas rígidos, frágiles y viscosos son caros de mantener; aplicar principios SOLID es un compromiso para reducir costes operacionales a largo plazo y tech debt.\n- Single Responsibility Principle (SRP): Cada clase debe tener solo una razón para cambiar, lo que significa que su responsabilidad debe estar vinculada a un único rol o stakeholder para evitar \"God objects\".\n- Dependency Inversion Principle (DIP): Los sistemas deben depender de abstracciones en lugar de implementaciones concretas, usando dependency injection para desacoplar lógica de alto nivel de detalles de bajo nivel.\n- Open/Closed Principle (OCP): Las entidades de software deben estar abiertas para extensión pero cerradas para modificación; las abstracciones deben introducirse mediante refactoring cuando realmente se necesita un segundo punto de extensión, en lugar de mediante over-engineering inicial.\n- Liskov Substitution Principle (LSP): Las clases derivadas deben ser completamente sustituibles por sus clases base; en Python, esto se logra mejor favoreciendo composition sobre inheritance para evitar abstracciones inapropiadas.\n- Interface Segregation Principle (ISP): Las interfaces más pequeñas y específicas son mejores que las grandes y de propósito general, ya que reducen dependencias innecesarias y mejoran la reusabilidad del código.\n- Test-Driven Development (TDD) como herramienta de diseño: Las prácticas técnicas como TDD no son solo para validación sino que son esenciales para diseñar arquitecturas testables que permiten a los desarrolladores hacer deploy con confianza y mínima ansiedad.\n- Profesionalismo y Clean Code: Escribir código clean y mantenible es una responsabilidad profesional que asegura que un equipo pueda continuar entregando features a ritmo constante sin que el sistema se vuelva \"inmóvil\".\n- Enfoque pythónico de SOLID: Aunque los principios permanecen constantes, la naturaleza dinámica de Python y el duck typing permiten abstracciones más simples y un énfasis más fuerte en composition sobre jerarquías de tipos rígidas.\n"
  }
]